[{"pk": 2, "model": "bidding.item", "fields": {"retail_price": "359.00", "description": "Kindle DX will be released this summer. Pre-order Kindle DX now to RESERVE YOUR PLACE IN LINE. We prioritize orders on a first come, first served basis, and we will notify you via e-mail when we have an estimated delivery date.", "name": "Kindle DX", "slug": "kindle-1"}}, {"pk": 1, "model": "bidding.item", "fields": {"retail_price": "399.99", "description": "Includes Sony PLAYSTATION 3 80GB system, DUALSHOCK 3 wireless controller, free PLAYSTATION Network membership, internet ready Wi-Fi, and 80GB of hard disk storage for all your games, music, videos, and photos. Every Sony PS3 comes with a built-in Blu-ray player to give you the best high-definition viewing experience and pristine picture quality. Plus, the PS3 can play your entire catalog of CDs and DVDs.", "name": "Sony PlayStation", "slug": "sony-playstation-1"}}, {"pk": 3, "model": "bidding.item", "fields": {"retail_price": "369.95", "description": "The iPod touch has always been an amazing iPod. And with its groundbreaking technologies--including a Multi-Touch screen, the accelerometer, and 3D graphics--and access to hundreds of games, iPod touch puts an amazing gaming experience in the palm of your hand. It comes in 8 GB, 16 GB, and 32 GB models with new volume controls and a built-in speaker. Play hours of music. Create a Genius Playlist of songs that go great together. Watch a movie. Surf the web. View rich HTML email. Find your location and get directions with Google Maps. Browse YouTube videos. And shop the App Store for games and applications.", "name": "iPod touch 32 GB", "slug": "Ipod-touch-32-GB"}}, {"pk": 4, "model": "bidding.item", "fields": {"retail_price": "2464.99", "description": "Make the move to the smoothest LCD action ever, with Samsung's LN52B750 LCD HDTV. Start with the incredible color and rich clarity of Full HD 1080p resolution, all on a 52-inch screen. Add the power of Samsung's newest Auto Motion Plus240Hz technology, for a new level of the most lifelike LCD action on the market. Samsung's Media 2.0 feature puts customizable widgets with content from partners like Flickr and Yahoo! Under your control, via your remote. A pre-loaded Content Library offers hours of built-in digital entertainment and information, from games to yoga routines. Four HDMI inputs make DVD, cable or satellite HD box, or Blu-ray Disc connectivity a snap. And with the attractive Touch of Color design, the subtle charcoal grey accent at the bezel's edge underscores this LCD HDTV's elegance.", "name": "Samsung 52inch LCD ", "slug": "samsung-52inch-lcd-hdtv"}}, {"pk": 7, "model": "bidding.item", "fields": {"retail_price": "249.99", "description": "Nintendo's Wii video game system (pronounced \"we\") brings people of all ages and video game experience together to play. This simple yet ground breaking idea is expressed not only though the system's evocative name, which is easily pronounced in a variety of languages, and suggests two players side by side, but also through its innovative list of features and extensive list of playable titles.\r\n\r\nA Little Box With Plenty of Power\r\nAs with every console, much of the buzz surrounds the specs. The Wii boasts 512 MB of internal flash memory, two USB 2.0 ports, and a slot for SD memory expansion. The system’s technological heart -- a processing chip developed with IBM and code-named \"Broadway\" and a graphics chipset from ATI code-named \"Hollywood\" -- deliver stunning performance. And instead of a tray, Wii uses a single, self-loading media bay that plays both 12-centimeter optical discs used for the new system, as well as Nintendo GameCube discs.\r\n\r\nRevolutionary Control\r\nNo bigger than a small traditional remote control, the wireless Wii Remote is a truly multi functional device. The magic of the Wii Remote's design lies within; acellerometers inside the controller measure movement in all directions and at all speeds. In a tennis game, it serves as your racket as you swing away. In driving games it serves as a steering wheel, allowing you to swerve to avoid obstacles or pickup power-ups. In first-person shooters, it acts as a firearm that you can point directly at an on-screen enemy. The controller also has a force feedback \"Rumble\" feature and an expansion port for use with accessories, such as the Nunchuck, which adds an analog thumbstick and trigger buttons. The system allows for up to four controllers to be linked at a time and utilizes standard Bluetooth wireless technology. For those who prefer the feel of a traditional controller an adapter is available that fits over the Wii's remote.\r\n\r\n", "name": "WII", "slug": "wii"}}, {"pk": 8, "model": "bidding.item", "fields": {"retail_price": "539.99", "description": "Introducing Xbox 360 Elite, the premier Xbox 360 console package that includes a massive 120GB hard drive, a HDMI port, and HDMI cable, all wrapped up with a premium black finish. Xbox 360 Elite also includes a black wireless controller and black Xbox LIVE® headset. Xbox 360 Elite has enough space for a whole library of Xbox LIVE Arcade games as well as downloadable high-definition TV shows, movies, music, and all the other content available from Xbox LIVE Marketplace.\r\n\r\nFeatures\r\n\r\n•Xbox 360 Elite console: The console is equipped with an HDMI port, HDMI cable, a black wireless controller and black Xbox LIVE® headset. It also comes with three powerful core processors, 16:9 cinematic aspect ratio, anti-aliasing for smooth textures, full surround sound, and DVD playback with upscaling capabilities right outof the box.\r\n\r\n•Xbox 360 120GB hard drive: The huge 120GB detachable hard drive allows gamers to save their games and store television shows, movies, music, pictures, trailers, extra game levels, demos and other content available from Xbox LIVE Marketplace. Also sold separatley.\r\n\r\n•Xbox 360 Wireless Controller (black): The sleek black finish of this high-performance wireless controller matches the style of the Elite Console. It has a range of up to 30 feet and a battery life of 30 hours on two AA batteries. Also sold separatley.\r\n\r\n•Xbox 360 headset (black): Now available in black, the headset lets you strategize while playing together online or tra taunts with your opponents. You can also send voice messages to friends on Xbox LIVE.\r\n\r\n•Xbox 360 HDMI cable: New to Xbox 360, HDMI lets you get HD video (up to 1080p) and multichannel surround sound, all from one cable.\r\n", "name": "Xbox 360 Elite 120GB ", "slug": "xbox-360-elite-120gb"}}, {"pk": 6, "model": "bidding.item", "fields": {"retail_price": "335.00", "description": "For you fans of the Betsey Johnson lifestyle, this bag is the perfect accessory to your wardrobe. The metallic hardware and animal print on this 'Ice Princess Mini Flap' gives it a quirky fix Betsey Johnson is known for. Tote style shoulder bag made of extravagant leather. Holds your wallet, keys, sunglasses, lipstick and personal technology. Simple stunning! Be seen in style!  Product Dimensions H 15.5\" x L 8.75\" x W 4\" Handle Drop: 9.5\" Actual Weight 2.85 lb Model Number BH24635 \r\n\r\nA staff favorite! ", "name": "Betsey Johnson Black", "slug": "betsey-johnson-black-drawstring-tote"}}, {"pk": 10, "model": "bidding.item", "fields": {"retail_price": "299.95", "description": "325-watt stand mixer with 10 speeds and 67-point planetary mixing action\r\nSolid, all-metal base; 5-quart stainless-steel bowl; 2-piece pouring shield\r\nUniquely styled tilting head allows clear access to the beater and bowl\r\nMultipurpose attachment hub; flat beater, dough hook, and wire whip included\r\nMeasures 14 by 8-2/3 by 14 inches; 1-year hassle-free warranty", "name": "KitchenAid Retro Mixer ", "slug": "kitchenaid-retro-mixer"}}, {"pk": 11, "model": "bidding.item", "fields": {"retail_price": "227.20", "description": "Garmin's nüvi 700 series brings two exciting new features -- multi-destination routing and, \"Where am I?/Where's my car?\" -- to its popular pocket-sized GPS navigator lineup. As with all nüvis, you get Garmin reliability, the fast satellite lock of an integrated high-sensitivity receiver, a slim, pocket-sized design with a gorgeous display, an easy, intuitive interface, and detailed NAVTEQ maps for the United States, Canada and Puerto Rico with more than 6 million name-searchable points of interest. All of the 700-series navigators also feature a rich array of features including spoken directions in real street names, MP3 player and photo viewer, and an FM transmitter that will play voice prompts, MP3s, audio books, and more, directly through your vehicle's stereo system.The nüvi 760 and  770 add integrated traffic receivers and Bluetooth capability for hands-free calling. The nüvi 770 adds maps for Europe. The nüvi 780 adds enhanced MSN direct content capability..\r\n\r\n", "name": "Garmin nüvi 760 ", "slug": "garmin-nuvi-760"}}, {"pk": 12, "model": "bidding.item", "fields": {"retail_price": "133.25", "description": "Your Games have Surround Sound…Why Don’t You?\r\n\r\nGames are meant to be experienced in surround sound. Hear your enemies sneaking up behind you or listen for the action in every direction.  The G51 brings your games to life with 360 degree urround sound.\r\n\r\nThe G51 is the first G-series speakers, designed specifically for gamers.  Besides delivering an immersive surround-sound experience and thunderous bass, it is equipped with gamer inspired features including the weighted, non-skid control pod, independent, easy-to-access mic and audio mute controls, and customizable satellite speakers.  In short, the G51 is authentic gaming equipment!", "name": "Logitech G51 Surround ", "slug": "logitech-g51-surround-sound"}}, {"pk": 9, "model": "bidding.item", "fields": {"retail_price": "269.99", "description": "Offering a sophisticated design developed with Italian luxury fashion house Prada that's mixed with a cutting edge user interface technology from LG, the tri-band PRADA Phone by LG (KE850) brings much more to the party than just stunning good looks. Its minimalist, black-tie industrial design has been complemented by a 3-inch touch screen that enables you to control virtually all the phone's functions with just your finger--no stylus needed. It's also loaded with bounty of features you expect from a top-of-the-line mobile phone: 2-megapixel camera with Schneider-Kreuznach optics, Bluetooth connectivity for stereo headphones, multi-format digital audio player, FM radio, MicroSD expansion, and PIM organizer applications to keep you on schedule.\r\n\r\n\r\nSleekly designed with a gorgeous black-and-silver fashion/industrial look, the PRADA phone measures just 0.5-inches thin.\r\n\r\n\r\nTurn the PRADA Phone over to take 400 x 240-pixel widescreen video or 2-megapixel still photos.\r\nThis unlocked cell phone can be used with a GSM network service provider and it provides tri-band voice connectivity (GSM/GPRS 900 MHz, 1800 MHz, 1900 MHz), enabling you to travel the globe and stay in contact. It also can handle high-speed data connectivity via EDGE data networks, which is fast enough to support a wide range of advanced data services (with average data speeds between 75-135Kbps), including video and music clips, full picture and video messaging, high-speed color Internet access, and email on the go. It does not come with a SIM card, and it requires that you provide a SIM card for usage with your selected service provider.\r\n\r\nAmazingly small with a body that measures 3.9 x 2.1 x 0.5 inches, the PRADA Phone weighs just 3 ounces (50 percent less than the Apple iPhone). The candybar has an understated, Avante-Garde design that resembles a highly styled high-definition television. It features a piano-black casing on the back and on the front surrounding the screen, and its features are softened by gently rounded corners. The sides are accented by a polished silver metal.\r\n\r\nYou'll interact with the PRADA Phone primarily with your finger on the 3-inch (diagonal) touchscreen, which has a resolution of 240 x 400 pixels and a display capability of 256K colors. The Flash-based user interface displays glowing icons that disappear when not in use to reveal a stark black Prada theme. However, the UI can be changed to one of three pre-loaded themes--the Butterfly and Fish themes actually place a small creature on the standby screen that can follow your finger around. The standby screen is also home to the clock, which is operated with finger taps and can be dragged around the screen. The PRADA Phone offers a virtual numeric keypad, instead of a virtual QWERTY keyboard, for dialing of numbers and writing text messages (with help from the integrated T9 predictive text entry technology). The main menu system is arranged like tabbed folder pages full of icons and is intuitive and quick to learn.", "name": "LG Prada Mobile", "slug": "lg-prada-unlocked-mobile"}}, {"pk": 13, "model": "bidding.item", "fields": {"retail_price": "67.53", "description": "For the first time ever Scorpion, Sub-Zero and the Mortal Kombat warriors battle with Batman, Superman and other popular DC Universe Super Heroes. Choose your side and challenge your opponents with a new fighting system including Freefall Kombat and Klose Kombat along with dynamic multi-tiered environments. Plus, pick your favorite character from MK or DCU and pursue a fighting adventure in the new single player mode with an intertwined storyline and two unique perspectives.", "name": "MC vs. DCU", "slug": "mc-vs-dcu"}}, {"pk": 14, "model": "bidding.item", "fields": {"retail_price": "59.00", "description": "Can you handle the truth? The De-FIB-ulator is the first hand-held voice tension detector. Certain to be a lot of fun and the life of the party.. Imagine the fun you\u001all have when you show off the deFIBulator at your next party. Use it for a game of truth or dare and you\u001all see who\u001as being honest and who\u001as not. The DeFIBulator is destined to be the most talked about new novelty product this year. After extensive research and development in labs in Singapore, Spion has developed the first generation of the DeFIBulator hand-held voice tension detector. The DeFIBulator was shown to have a very high accuracy rate. Can also Connect to Your Cell Phone for Direct Digital Connection The DeFIBulator utilizes voice tension technology to measure varying degrees of vibration in the voice. These vibrations are caused by the user going from a state of calm, to being a little nervous as you would when you lie. Even an F.B.I. polygraph isn\u001at 100% accurate but after extensive testing, the DeFIBulator was shown to have a 65% accuracy rate. The DeFIBulator can even be connected to your cell phone! Because of the digital connection, it will actually be much more accurate. To train the DeFIBulator to the human voice, ask your subject 3 yes/no questions and then record the voice to establish a baseline. Then ask the real yes/no questions and watch the figure on the screen. \u001aDemonochio\u001as\u001a nose will grow and his horns will appear. The greater the tension in the voice, the longer his nose and horns will be. The DeFIBulator is to be used for amusement only and is guaranteed to be the life of the party! Get Yours Today!", "name": "Defibulator Portable Lie Detector", "slug": "defibulator-portable-lie-detector"}}, {"pk": 15, "model": "bidding.item", "fields": {"retail_price": "159.00", "description": "No, it's not red - it's green Okay, just about everyone has a red laser pointer. Heck, we even sell a fine one here at ThinkGeek. But, we're pretty sure you want to be a superior geek - and doing it with a green laser is the way to go. This pointer is significantly brighter (about 50 times) than a red laser pointer and because of its unusual color it is much more noticeable. I mean come on, a 532 nm green laser wavelength is obviously superior to a laughable 650 nm red laser wavelength. And unlike a red laser, the green beam itself can be seen in mid-air in dark conditions, not just the laser beam dot. This allows the green laser pointer to be used for pointing to star constellations (skypointing) and also just generally look cool as hell. The green laser beam dot can be seen at much greater distances than with a red laser pointer. Since green direct injection laser diodes aren't readily available, this pointer is based on the use of Diode Pumped Solid State Frequency Doubled (DPSSFD) laser technology. A high power IR laser diode at 808 nm pumps a tiny block of Nd:YVO4 generating light at 1,064 nm which feeds a KTP intracavity frequency doubler crystal to produce the green beam at 532 nm. Features of this unit include: Very bright green laser at 532 nm wavelength Output power of <5mW (Class IIIa Laser Product) Range of approximately 9,000 ft (2600 m) in darkness 1.1 mm beam diameter at source Momentary push button switch Solid, heavy duty construction Constant wave out.", "name": "Green Laser Pointer II", "slug": "green-laser-pointer-ii"}}, {"pk": 16, "model": "bidding.item", "fields": {"retail_price": "150.00", "description": " 20mw 532nm Astronomy Powerful.\r\n\r\nBlack Dimple Finish High Power Green Laser. We ensure that every high power green laser pointer is hand calibrated and tested to output at least 20mw and thus offers the expected stunning power expected of a real constant wave green (532nm) laser pointer, much brighter to look at than a regular red laser pointer and always with a visible green beam. This high power green laser pointer will impress your coworkers, family and friends. Use it for your next presentation and everybody will know that you are ahead of the latest technology.\r\n ", "name": "Green Laser Pointer", "slug": "green-laser-pointer"}}, {"pk": 17, "model": "bidding.item", "fields": {"retail_price": "89.99", "description": "The Micro SD Camera is so small, it can fit inside a pack of gum! This camera lets you record any video or audio with a single push of a button. The Micro SD Camera records hi-resolution real time audio and video @ 15fps via its internal 3.6MM pin hole camera. Plug the Micro SD Camera into your computer via the USB cable and instantly watch your video and audio recordings! Features - Incredible 33 hours of video and audio storage on a 1GB card. Easy One Touch Recording. Record up to 2 hours on a single charge with internal rechargeable battery. 3GP (177 x 144) Resolution. Can also be used as a USB Storage Device. Wide Angle 3.6mm lens", "name": "Mega Mini Spy Camera", "slug": "mega-mini-spy-camera"}}, {"pk": 18, "model": "bidding.item", "fields": {"retail_price": "210.00", "description": "Wireless Handheld Color Pinhole Camera System.\r\n\r\nThe GX5204 is a wireless color camera system that can be hidden for undercover indoor use. It comes with everything you need to start monitoring. The camera is tiny, but just as powerful as most full size cameras with an incredible 360 TV lines of resolution! Due to its pinhole lens it can be hidden anywhere. It is also a transmitter, allowing you to wirelessly send video to the included handheld monitor. The monitor has a 2.5\" LCD screen for crystal clear viewing of your camera's display, or you can connect it to your TV, VCR, DVR or computer for viewing and recording purposes. This system comes with one camera, but you can add 2 more SVAT compatible cameras, and the auto feature allows you to cycle between the cameras at intervals that you choose. This system is ideal for discreet monitoring in home or business settings due to its small size and wireless capabilities. The camera and monitor are both powered by AC adapters but are also battery operable for ultimate portability (camera uses 9V battery; monitor uses 4 AAA batteries, or rechargable battery pack - GX519B, not included).It includes: 1 color camera, 1 LCD monitor, 2 power adapters, 3.5mm to RCA (male) wire, Portable battery clip, mounting bracket, mounting hardware, instruction manual, on-line/toll free tech support and 1 year warranty. It is compatible with GX515, GX5201, GX5203, WSE201, WSE201C, WSE103, WSE103C.\r\n", "name": "Wireless Camera System", "slug": "wireless-camera-system"}}, {"pk": 19, "model": "bidding.item", "fields": {"retail_price": "30.99", "description": "4G SPY CAMERA with BLACK FINISH Accessories Included.\r\n\r\nAjoka Pen Camera is not just an ordinary cheap Pen Camera available in the market with thousands other cheap Spy Gadgets. This is a Real Professional Pen DVR Camera for the professional investigators or Law enforcement agencies who need real hidden evidance for the court. Specification Packing Included: Real time Date and Time Stamping Pen DVR, 4GB Built In Memory·Video: 0.3 Mega pixel, AVI format User Manual, Still Photo: 640 X 480, JPEG format Emergency Charger with AA size battery, Build in Microphone Utility disk, ormal size pen with Hand writing function USB connector,Build in lithium battery Charger connector, Support operating system WIN2000\u001aWIN XP 2 pieces extra Refills for the pen, High speed USB2.0 interface Nice Gift box, Portable U-disk function, Support Firmware Upgrade.\r\n\r\n", "name": "4G SPY CAMERA ", "slug": "4g-spy-camera"}}, {"pk": 20, "model": "bidding.item", "fields": {"retail_price": "159.95", "description": "Bounty Hunter Tracker IV Metal Detector.\r\n\r\n\r\n    * Three operating modes: Motion All-Metals, Full Discrimination, and Tone Discrimination\r\n    * Full Discrimination mode rejects iron and trash\r\n    * Tone discrimination mode provides two audio pitches\r\n    * Includes a sensitivity meter and built-in speaker and headphone jack\r\n    * Measures 10 inches in length, 9 inches in width and 57 inches in height\r\n\r\n", "name": "Bounty Hunter Tracker IV ", "slug": "bounty-hunter-tracker-iv"}}, {"pk": 21, "model": "bidding.item", "fields": {"retail_price": "358.00", "description": "Bestduplicator 1 to 5 Target DVD Cd Duplicator with Pioneer Dvdrw Burners Athena Duplication Controller, Standalone Copier Dvd Recorder Black.\r\n\r\n    *  Supports DVD+/-R, DVD+/-RW, DVD+/-R Dual Layer, CD-R, CD-RW blank media standards\r\n    * Auto Source Disc Analyzing, Master Error Proof,Copy, Test, Verify, and Compare functions available\r\n    * Self diagnostics with power start, disc formats automatically detected for stable and secure burning\r\n    * Easy to use Password protection modes to prevent unauthorized usage\r\n    * Comes with a 1 year warranty (parts & labor included) and free technical support\r\n\r\n", "name": "DVD Cd Duplicator ", "slug": "dvd-cd-duplicator"}}, {"pk": 22, "model": "bidding.item", "fields": {"retail_price": "183.40", "description": "Sony VRDMC5 DVDirect DVD Recorder.\r\n\r\nSony’s newly re-styled DVDirect® DVD recorder, the VRD-MC5, allows home video and digital photos to be recorded to DVD without a PC. The VRD-MC5 can be connected to virtually any camcorder, VCR, even Digital Video Recorders (DVRs) for direct recording of video to standard DVDs playable on most consumer DVD players. The MC5 also incorporates memory card slots for the 5 popular camera memory card types and will directly record images from the memory card to DVD as a playable slideshow or just for photo storage. The built in 2.5” color LCD screen makes it easy to preview video or view up to 6 digital pictures at a time. The VRD-MC5 thrusts DVDirect into the high definition world by supporting transfer of AVCHD video to DVD. AVCHD is a high definition camcorder format supported by some Sony Handycam camcorders. For example, high definition AVCHD video can be transferred from Sony hard disk or Memory Stick based Handycam camcorders to DVD in native 1080i resolution and played back on most Blu-ray Disc™ players /recorders and other compatible devices. The VRD-MC5 can also transfer video from Sony standard definition and AVCHD HDD/MemoryStick Handycam camcorders at up to 6X speed, which translates to 1 hour of video recorded in about 10 minutes. Record all the video to DVD from Sony HDD/MemoryStick Handycam camcorders, just selected scenes, even just the video shot since the last DVD burn. Full support for 4:3 full screen or 16:9 wide screen video and Dolby® Digital 5.1 surround sound.", "name": "Sony DVD Recorder", "slug": "sony-dvd-recorder"}}, {"pk": 23, "model": "bidding.item", "fields": {"retail_price": "149.99", "description": "Toshiba DR410 1080p Up converting Tuner less DVD Recorder.\r\n\r\nDVD Recorder with 1080p Upconversion\r\n\r\nProduct Description\r\nSave your favorite home movies to DVD, and get the most out of your DVD collection with 1080p conversion via HDMI to near HD picture quality, for an amazing viewing experience on today's HDTVs with the D-R410. Compact design and numerous recording and playback options make it a great solution for your home theater needs. Digital Photo Viewer (JPEG) One Touch Recording makes recording your favorite show simple. Just connect your DVD recorder to your cable or satellite box and you are set to record with the push of one button Auto Finalize with Undo simplifies the recording process by automatically finalizing your recording for playback on standard DVD players 24bit Audio DAC with 192kHz Processing Plays MP3 and WMA formats (2-Ch) Dolby Digital Recording L-PCM Recording (XP mode only) 3D (Virtual Surround Sound) Features - Instant Skip, Zoom, Editing (Playlist/Rename Title/Chapter Creation), and Commercial Skip Connections - Component Out, HDMI Out with REGZA LINK, Rear S-Video Input/Output, Rear RCA-Video Input/Output, Rear Analog Audio Input/Output, Coax Output, Front DV Input Approximate Unit Dimensions - 16.54 (W) x 2.32 (H) x 9.72 (D)\r\n\r\n", "name": "Toshiba Upconverting DVD-R", "slug": "toshiba-upconverting-dvd-r"}}, {"pk": 25, "model": "bidding.item", "fields": {"retail_price": "249.99", "description": "Samsung BD-P1500 1080p Blu-ray Player\r\n\r\nExperience the blu-ray difference with the SAMSUNG BD-P1500. TheBD-P1500 lets you have it all - watch your favorite DVDs and blu-ray discs or listen to CDs with the highest-quality audio.\r\n\r\nSamsung BD-P1500 with DimensionsFull 1080p resolution gives you the most outstanding HD image quality.Enjoy a richer, bolder color palette via extended gamut YCC technology. HDMI 1.3 transmission bandwidth capabilities ensure the strongest signal fidelity, while the Ethernet connection lets you easily check for the latest firmware upgrades online. Control all your Samsung AV devices from one remote, via Anynet+ technology. And advanced audio compatibility, including DD+, and True-HD, offers premium sound, for the greatest HD experience.", "name": "Samsung Blu-ray Player", "slug": "samsung-blu-ray-player"}}, {"pk": 24, "model": "bidding.item", "fields": {"retail_price": "499.99", "description": "Panasonic DMP-BD30K 1080p Blu-ray Disc Player\r\n\r\nBlu-ray means incredible full-HD images, breathtaking sound and 5x the data capacity of DVDs. Now Blu-ray means something else too: an entirely new movie-viewing experience, made possible by Final Standard Profile, which adds features never seen before, like four Picture-in-Picture modes including Enhanced Commentary (from directors and actors), Backstage Pass, Peek Behind the Animation and Audio Mixing.\r\n\r\nImages So Real, You Feel Like You're in the Picture\r\nCombining a PHL Reference Chroma Processor with advanced P4HD (Pixel Precision Progressive Processing) imaging technology, UniPhier — the Precise Digital Video processor — reproduces crisp, natural colors that are extremely faithful to the original movie. It does this by up-sampling the color information in decoded video signals, while the super high-speed P4HD up-converts content recorded in 480i/p, 720p or 1080i format to 1080p by correctly generating each pixel according to information drawn from up to 60 surrounding pixels. The image motion of each pixel is then categorized into one of 16 levels, from stationary to super fast. Image quality is further enhanced by Diagonal Processing, which creates smooth, sharp diagonal lines, and 3:2 Pull-Down, which optimizes the processing accordingly for film or video making the images look natural and lifelike. In addition, the DMP-BD30's HDMI output is Deep Color compatible, with 4,096 steps of gradation for even smoother, finer-quality images that meet Hollywood's stringent demands, so you can experience movies just the way they were meant to be experienced. ", "name": "Panasonic Blu-ray Player", "slug": "panasonic-blu-ray-dplayer"}}, {"pk": 26, "model": "bidding.item", "fields": {"retail_price": "399.99", "description": "Sony BDP-S550 1080p Blu-ray Player\r\n\r\nBring home the future of Blu-ray Disc technology with BD-Live and the BDP-S550 Blu-ray Disc player. The S550 is the step-up model to Sony's BDP-S350. It adds a gigabyte of onboard memory, so you can enjoy expanded Blu-ray capabilities like BD-Live interactive features right out of the box, and dts-HD compatibility for studio-quality sound.\r\n\r\nBD-Live takes your movie experience to a whole new level. Download and stream bonus content such as additional scenes, shorts, trailers and movie-based games. Equipped with a built-in Ethernet port, the BDP-S550 makes it easy to access specially created BD-Live content and Bonus View features. A USB port that allows you to add more storage to access the growing number of special features that will be available given the immense storage capacity of Blu-ray discs themeselves. This player outputs a Full 1080/24p True Cinema picture and  upscales your existing DVD collection to 1080p when using the HDMI connection. Dolby TrueHD/DTS-HD delivers studio master quality audio which is designed specifically for high definition entertainment. Make the most of all of these features with the icon-based Xcross Media Bar, which provides simple navigation of the player's menu system.", "name": "Sony Blu-ray Player", "slug": "sony-blu-ray-player"}}, {"pk": 27, "model": "bidding.item", "fields": {"retail_price": "179.99", "description": "Sony DVP-FX820 8-Inch Portable DVD Player, Black\r\n\r\nWatch movies anytime and anywhere you want with Sony's cool and colorful DVP-FX820 Portable DVD Players. With a 6hr battery life, an 8\" high-resolution swivel screen that provides a clear and crisp picture from any angle, 2 headphone jacks for sharing, and a car adapter that ensures your movies outlast even the longest road trip. And when you want more than movies, the FX820 plays your CDs or MP3s, and lets you view your personal photo albums. You can choose your preferred color among Black, Cherry Red, Cool Blue, Bubble Gum Pink and Snow White. Then, sit back and enjoy the crispy and sharp image with this Sony high-resolution LCD display.", "name": "Sony Portable DVD Player", "slug": "sony-portable-dvd-player"}}, {"pk": 29, "model": "bidding.item", "fields": {"retail_price": "89.99", "description": "Samsung DVD-1080P8 1080p Upconverting DVD Player\r\n\r\nWith the Samsung 1080P8 DVD player, everything old is new again. Experience your favorite movies in beautiful high definition. This DVD player will upconvert your standard DVDs to 1080 high definition so you can enjoy an enhanced cinematic experience with superior sharpness, color and details. Plays Standard DVD, DVD-R, DVD-RW, DVD+R, DVD+RW, CD, CD-R, CD-RW in any of the following formats: MP3, WMA, JPEG, MPEG-4, or DivX. Upconverts to 720p, 1080i,1080p depending on the capability of your television. There is also a 14 Bit/108 MHz digital-to-analog converter onboard.", "name": "Samsung DVD Player", "slug": "samsung-dvd-player"}}, {"pk": 30, "model": "bidding.item", "fields": {"retail_price": "120.00", "description": "Big picture, big fun! Watch your favorite TV shows and DVDs ? even play video games ? projected up to 90\" (diagonally) on any wall in your home. The projector's on-board inputs make it easy to connect your media components, so it takes just minutes to setup and enjoy. Model 1617293.", "name": "Entertainment TV Projector", "slug": "entertainment-tv-projector"}}, {"pk": 31, "model": "bidding.item", "fields": {"retail_price": "599.99", "description": "Optoma EP721 SVGA 2200-Lumens DLP Multimedia Data Projector\r\n\r\nThe Optoma EP721 is a multi-faceted digital projector that is unparalleled in features and functionality. Featuring 2200 lumens of brightness and a variety of connectivity options, the EP721 is a lightweight SVGA powerhouse. The EP721 is the essential presentation tool that is user-friendly and delivers superior performance.", "name": "Optoma Projector", "slug": "optoma-projector"}}, {"pk": 32, "model": "bidding.item", "fields": {"retail_price": "599.99", "description": "From the Manufacturer\r\nA Shared Vision\r\nIntroducing the InFocus X6 digital multimedia projector--designed for collaborative environments, including the office, classroom, home theater or large-format public display. As an all-new take on affordable, high-quality digital projection the X6 features advanced DLP technology in a compact size with an integrated audio system and secure installation options. For further simplicity, the multifunction remote control slides into the projector chassis for storage and transportation.\r\n\r\nThe X6 is an ideal first step into digital projection. It features SVGA resolution, which is an outstanding introduction to digital projection. The X6 has impressive brightness and contrast and all the connectivity options necessary to be truly effective in every meeting.\r\n\r\nPerformance Factor\r\nThe search for a steady-performing, reliable projector ends here and it's completely affordable. The X6 features 2000 Max ANSI Lumens and an 2000:1 Contrast Ratio which equates to bright images with lush color saturation and deep black levels, even in meeting spaces with present ambient light. The X6 utilizes the latest BrilliantColor technology to output true-to-life colors and shades through a wide, short throw lens, providing big image flexibility to smaller rooms.\r\n\r\nContributing More\r\nNearly all computers utilize a VGA output for monitors and projectors, so the X6 hosts VGA input for data presentations, along with S-video and composite video inputs for multimedia presentation material from a DVD player, camcorder or digital camera. These projectors offer onboard  serial input for IT integration applications--providing full functionality with maximum flexibility at an affordable price. Also, the X6 beautifully projects video content, so when business ends on Friday feel free to enjoy these projectors at home.", "name": "InFocus X6 DLP Projector", "slug": "infocus-x6-dlp-projector"}}, {"pk": 34, "model": "bidding.item", "fields": {"retail_price": "89.99", "description": "Sirius Stiletto 10/100 Vehicle Kit SLV1\r\n\r\nThe Stiletto vehicle Docking Kit is essential for those who want to get the most complete SIRIUS listening experience while in their vehicle. The Stiletto vehicle Docking Kit provides direct access to all of the features you would expect from an in-vehicle radio with a 10 preset button and integrated FM Modulator. It also includes our One-Touch Jump button for instant access to traffic and weather.\r\n\r\nProduct Description\r\nThe Stiletto Vehicle Docking Kit is essential for those who want to get the most complete SIRIUS listening experience while in their vehicle. Keep your Stiletto charged and ready to go while docked in the vehicle with the built in charger.", "name": "Sirius Stiletto ", "slug": "sirius-stiletto"}}, {"pk": 33, "model": "bidding.item", "fields": {"retail_price": "69.99", "description": "Sirius SUPV1 Universal Dock & Play Vehicle Kit\r\n\r\nThe Sirius SUP-V1 universal plug 'n' play vehicle kit comes with everything you need to play your Sportster 4, Starmate 4, or Stratus satellite radio receiver through your car's stereo speakers. The kit is designed around a handy docking cradle, which teams with the windshield suction cup mount to hold your receiver at an easy-to-access angle. The bundled antenna, meanwhile, includes a magnetic base that attaches to the roof or trunk lid of your car, letting you enjoy superior satellite reception wherever you drive. Finally, the kit comes with a 12-volt power adapter, which plugs into your car's cigarette lighter port. Once connected, you'll have access to more than 130 streams of original Sirius programming beamed coast to coast, including 65 streams of commercial- free, digital-quality music, along with multiple news, talk, sports, entertainment, and children's stations. Other details include an alternative vent mount for the docking cradle and mounting hardware. The entire kit is backed by a one-year warranty.\r\n", "name": "Sirius Universal Dock Car", "slug": "sirius-universal-dock"}}, {"pk": 35, "model": "bidding.item", "fields": {"retail_price": "69.99", "description": "Sirius SUPH1 Universal Dock and Play Home Kit\r\n\r\nThe Sirius SUP-H1 universal plug 'n' play home kit comes with everything you need to play your Sportster 3, Sportster 4, Starmate 3, Starmate 4, and Stratus satellite radio receiver through your home stereo speakers. The kit is designed around a handy mounting cradle, which holds your receiver in a single easy-to-access location. Just slide your Sirius receiver into the cradle and rest it on a tabletop, desk, bookshelf, or entertainment center. Once the receiver is mounted, users have two listening options: they can rely on the receiver's built-in FM transmitter, or they can run the included RCA audio cable between the cradle's audio output and the stereo. The latter option delivers a better overall sound, but is slightly more cumbersome. The bundled antenna, meanwhile, is fully weatherproof, so you can install it indoors or outdoors depending on where the satellite signal is strongest. Finally, the kit comes with an AC adapter that powers your Sirius receiver and a spacer for the docking station (required for the non- Sportster models). In sum, the kit delivers access to more than 130 streams of original Sirius programming beamed coast to coast, including 65 streams of commercial-free, digital-quality music, along with multiple news, talk, sports, entertainment, and children's stations. The entire kit is backed by a one-year warranty.", "name": "Sirius Universal Dock Home ", "slug": "sirius-universal-dock-home"}}, {"pk": 36, "model": "bidding.item", "fields": {"retail_price": "169.99", "description": "SIRIUS Sportster 5 Satellite Radio Receiver with Vehicle Kit\r\n\r\nWith a stylish new gun-metal grey finish, the Sportster 5 satellite radio receiver sports a new slim profile while still maintaining the same great features for which the Sportster series is known. Highlights include a large, multicolor, easy-to-read 6-line display, plus a rotary tuning knob for added convenience. The Sportster 5, conveniently transportable between home and car, is easy to use and features Sirius' universal dock for simple installation. Optional universal accessory docking kits and audio systems conveniently allow for use in the home, boat, office, and multiple vehicles.", "name": "SIRIUS Sportster ", "slug": "sirius-sportster"}}, {"pk": 37, "model": "bidding.item", "fields": {"retail_price": "139.99", "description": "CAKE DECORATING AIRBRUSH KIT with 12 Food Colors and Air Compressor\r\n\r\n    * Standard Professional Airbrush Cake Decorating System\r\n    * Airbrush, Compressor with Hose and 12 - 4.5 oz. Americolor AmeriMist Food Colors\r\n    * Has everything you will need to get started! Perfect for Bakery's or for Private Use.\r\n    * 12 Large 4.5 Ounce Bottles of the Most Popular Americolor AmeriMist Air Brush Food Colors\r\n    * Airbrush Model G22 Multi-Purpose Precision Dual-Action Gravity Feed Airbrush\r\n", "name": "Cake Decorating Airbrush Kit ", "slug": "cake-decorating-airbrush-kit"}}, {"pk": 38, "model": "bidding.item", "fields": {"retail_price": "129.99", "description": "Beginner/Starter DUAL-ACTION Siphon AIRBRUSH/COMPRESSOR\r\n\r\nThe MAS-S68 sprays with most types of paint media and has a broad spray pattern. Comes with a 0.35mm needle/nozzle and a 1/6 oz. siphon fluid cup and a 3/4 oz. siphon fluid bottle. It packs 15-50 PSI pressure. The kit includes TH-021 6-foot Air Hose and TC-20 Air Compressor described below. Our new featured mini compressor is an Oil-less Maintenance-Free 1/5HP Auto-Stop (Preset at 60 PSI), Thermal Protected unit with much higher quality standards built in than most other airbrush compressors on the market today. Mini airbrush compressor TC 20 is designed to work only when you do. With this unique automatic on/off shutoff switch, it only operates when you are airbrushing. This \"Air-On-Demand\" feature allows the compressor to operate much cooler and avoid overheating problems that frequently plague other compressor models. The new TC 20 delivers more air volume (CFM) and pressure (PSI) than any airbrush demands. The unit has a water trap to ensure clean, dry air, and the true diaphragm regulator & Gauge which allows you to accurately control the air pressure to the airbrush from 0 to 60 PSI.", "name": "Beginner Airbrush/Compressor", "slug": "beginner-airbrushcompressor"}}, {"pk": 39, "model": "bidding.item", "fields": {"retail_price": "59.95", "description": "PRECISION DUAL-ACTION AIRBRUSH Fine Detail Graphic Art\r\n\r\n * Our Best Selling Detail Airbrush!\r\n    * Finely atomizes fluid, providing extra control and increased detail\r\n    * Features a 4 piece matched airbrush head system with a 0.2mm needle/nozzle and a 1/3 oz. funnel shaped gravity cup.\r\n    * Dual-Action (Double-Action) Trigger Air/Fluid Control\r\n    * Internal Mix (Thoroughly Atomized Fine Dot Spray Pattern)\r\n\r\n", "name": "Precision Dual Action Airbrush", "slug": "precision-dual-action-airbrush"}}, {"pk": 40, "model": "bidding.item", "fields": {"retail_price": "86.95", "description": "Oil Paint & Easel Art Set Makes the Perfect Gift for Any Aspiring Artist! (1 Set)\r\n\r\nEverything you need to get you started painting in your favorite medium. It's all here in a portable, sturdy tote and at one great price. This art set is a great gift for any budding artist. Featured in each set is an adjustable, genuine hardwood tabletop easel along with all the tools you need to get started. You'll find these sets perfect for home, studio, classroom or in the field. This special offer is for 1 Oil Paint Easel Art Set. Everything you need to become the artist you always wanted to be!", "name": "Oil Paint & Easel Art Set ", "slug": "oil-paint-easel-art-set"}}, {"pk": 41, "model": "bidding.item", "fields": {"retail_price": "19.99", "description": "Stainless Steel Painting Knife - Pallet Knife 5-Piece Set - Type 93\r\n\r\n*Super-thin, flexible and durable stainless steel knife set for professional or hobby artist*5 of the most commonly-used blade sizes & styles: (from top to bottom in photo) 3-1/2\" #1, 3\" #2*2-1/2\" #3, 2\" #4, 1-1/2\" #5; five unique blunt-edge shapes for mixing or applying oil paint*Angled handles help keep artist's hand away from paint surface*Contoured, lightweight hardwood handles are comfortable to holdAn outstanding value in a quality set of essential oil painting tools for artists of all skill levels. Useful around home and shop with lots of other uses, too.", "name": "Stainless Steel Painting Knife ", "slug": "stainless-steel-painting-knife"}}, {"pk": 42, "model": "bidding.item", "fields": {"retail_price": "34.99", "description": "35 Piece Oil Painters Art Set Has All The Essentials And Makes A Great Gift\r\n\r\nThis oil painting art set offers appeal to a range of artistic skills with its large selection of colors and carefully selected accessory components. Manufactured by the Royal Langnickel Company, the parts include 26 tubes of oil paints, 4 white bristle brushes, 2 drawing pencils, a pencil sharpener, an eraser and a 6-well plastic palette. All 35 components are nestled inside a handsome hinged wood case with dovetailed corners, snap locks and a comfortable handle. The lid opens flat for easy access. In addition to the quality materials inside, the set has a colorful sleeve and clear overwrap and makes an exciting presentation gift. Best of all, we are able to offer a substantial discount from the manufacturer's list price. For hundreds more craft, art and hobby products be sure to visit our National Artcraft Storefront. We have the creative component you need.", "name": "35 Piece Oil Painters Art Set ", "slug": "35-piece-oil-painters-art-set"}}, {"pk": 43, "model": "bidding.item", "fields": {"retail_price": "119.00", "description": "Heritage Elm Wood French Box EaselAttractive and sturdy the Basic French Easel is crafted out of oiled elm wood. It conveniently folds to sketch-box size and opens up quickly to form a full three-legged easel that can accommodate canvases up to 33 inches high. Telescoping legs with nonskid rubber feet make this easel ideal for both sitting and standing work. Also features a divided sketch box drawer palette and adjustable shoulder strap. Overall measurements: 28 x 45 x 71 inches.", "name": "Heritage Elm Wood French Box Easel", "slug": "heritage-elm-wood-french-box-easel"}}, {"pk": 44, "model": "bidding.item", "fields": {"retail_price": "39.99", "description": "* Turn family photos into spectacular scrapbooks in just 3 easy steps\r\n    * Preserve precious memories with 6,000+ exclusive designs and 60,000+ premium graphics--all inside the box\r\n    * Customize your scrapbook pages with 5,000+ photorealistic embellishments\r\n    * Create CD Photo Scrapbooks you can watch on TV\r\n    * New and improved Built-in Digital Photo Editor\r\n", "name": "Scrapbook Factory Deluxe 4.0", "slug": "scrapbook-factory-deluxe-40"}}, {"pk": 45, "model": "bidding.item", "fields": {"retail_price": "39.99", "description": "This chopper is the best on the market. it completely comes apart and cleans easily. the blades never dull. when chopping onions, no odor creeps into your eyes. easy to operate even with arthritic hands.", "name": "The Pampered Chef Food Chopper", "slug": "pampered-chef-food-chopper"}}, {"pk": 46, "model": "bidding.item", "fields": {"retail_price": "82.99", "description": "Nursery-To-Go Pam's Petals Bedding 10 Piece Crib Set\r\n\r\n * This set completes the nursery\r\n    * Made of 100% cotton and micro-suede\r\n    * Machine washable set\r\n    * It is a delight for any baby girl¿s nursery\r\n    * Includes 10 pieces: quilt, bumper, sheet, crib skirt, valance, diaper stacker, musical mobile and three wall hangings\r\n\r\n", "name": "10 Piece Crib Set", "slug": "10-piece-crib-set"}}, {"pk": 47, "model": "bidding.item", "fields": {"retail_price": "56.99", "description": "Boutique Safari Jungle Animals 10pcs \r\n\r\n   * 10 Piece Set Includes:(1)Crib Quilt ,(1)Crib Bumper\r\n    * (1)Fitted Sheet,(1)Crib Skirt (Dust Ruffle),(1)Diaper Stacker\r\n    * (2)of Window Valances ,(1)Toy Bag ,(1)Baby Pillow\r\n    * (1)Baby Bib - 100% Cotton\r\n    * This set fits all Baby cribs and Toddler Bed!", "name": "10 Piece Crib Set Safari", "slug": "10-piece-crib-set-safari"}}, {"pk": 48, "model": "bidding.item", "fields": {"retail_price": "139.99", "description": "20 PC. SUPER BED IN A BAG COMFORTER SET W/ MATCHING SHEETS, PILLOWS AND ROBES, BLUE / GOLD\r\n\r\n# Ice Blue stands out beautifully against a soft gold in this most luxurious bed in a bag set.\r\n# Includes bonus pcs: Two matching robes, Coverlet, Blue Sheet Set, Gold Sheet Set.\r\n# Set Includes: Comforter, Bedskirt, Two Shams, Two Euro Shams, 2 Sheet Sets, 2 18x18 Pillows,\r\n# 12x18 Breakfast Pillow, 86x88 Coverlet, two robes.\r\n# Sheets are 100% cotton with a 210 thread count", "name": "20 PC. SUPER BED COMFORTER ", "slug": "20-pc-super-bed-comforter"}}, {"pk": 49, "model": "bidding.item", "fields": {"retail_price": "139.99", "description": "* 6 Piece Duvet Bedding Set: 1 Duvet, 2 Pillow Shams, 1 Bed Skirt, 2 Decorative Throw Pillows\r\n    * 300 threadcount, 100% Cotton\r\n    * Hidden Button Enclosure and Inside Stationary Tie Downs to Hold Comforter in Place\r\n    * Dimensions: Duvet- King(106\"x90\") Queen(88\"x94\"), Sham- King(20\"x36\") Queen(20\"x26\")\r\n    * Matching accessories are available. Please see below.\r\n", "name": "Chocolate Collection Duvet ", "slug": "chocolate-collection-duvet"}}, {"pk": 50, "model": "bidding.item", "fields": {"retail_price": "129.99", "description": " * 6 Piece Set Includes: 1 Duvet, 2 Pillow Shams, 1 Bed Skirt, 2 Decorative Throw Pillows\r\n    * Machine Washable Soft Micro Suede Fabric\r\n    * Hidden Button Enclosure and Inside Stationary Tie Downs to Hold Comforter in Place\r\n    * Dimensions: Duvet- King(104\"x90\") Queen(88\"x90\"), Sham- King(20\"x36\") Queen(20\"x26\")\r\n    * Stylish Blue, Chocolate, and Camel Color Pallet\r\n", "name": "Luxury Duvet Comforter Cover ", "slug": "luxury-duvet-comforter-cover"}}, {"pk": 51, "model": "bidding.item", "fields": {"retail_price": "83.00", "description": "Sea Gull Lighting 3121-72 Traditional Five-Light Chandelier, Olde Iron Finish\r\n\r\nSea Gull Lighting's Traditional Five-Light Olde Iron Finish Chandelier features Colonial Styling with Graceful, Authentic detailing to delight the eye. Fixture comes with 12-Feet of wire. Optional Shades Available. Sea Gull Lighting produce some of the worlds best lighting products -- It's Your Home, It's Your Style. Let Sea Gull Lighting help define your space.\r\n\r\nProduct Description\r\nSea Gull Olde Iron Mid Sized Chandeliers ", "name": "Traditional Five-Light Chandelier", "slug": "traditional-five-light-chandelier"}}, {"pk": 52, "model": "bidding.item", "fields": {"retail_price": "170.00", "description": "Murray Feiss F1879/1BRB Maison de Ville One-Light Mini DuoMount Chandelier, British Bronze with Prismatic Glass Crystals\r\n\r\nThe Murray Feiss Maison de Ville One-Light Mini DuoMount Chandelier may be mounted flush to ceiling or hanging the piece captures the spirit of French Versailles Age of opulence. Notice the central faceted crystals blend into the slender graceful arms. This is a rich British Bronze Finish with romantic detailing.\r\n\r\nProduct Description\r\nAn old world style with a romantic flair. This mini chandelier from Murray Feiss features majestic crystal designs around a scroll detailed frame. The bronze finish complements the classic chandelier. It can also be used as a hanging fixture or mounted close to the ceiling. This chandelier has an antique look with brilliant crystal glass accents. Takes one 100 watt bulb (not included). Measures 11\" wide. 14 1/4\" high", "name": "One-Light Mini DuoMount Chandelier", "slug": "one-light-mini-duomount-chandelier"}}, {"pk": 53, "model": "bidding.item", "fields": {"retail_price": "124.99", "description": "Hardware House 544452 24-Inch by 15-Inch Chandelier Brushed Nickel\r\n\r\nEnhance your decor with this beautiful 24-inch by 15-inch brushed nickel, five light chandelier. The alabaster glass in this chandelier brings a cozy warmth to any room. Five 60-watt bulbs are required. These are not included with the chandelier.\r\n\r\nProduct Description\r\nBRISTOL SERIES CHANDELIER - 5- light chandelier with alabaster glass ~ Uses (5) 60 watt bulbs ( not included )\r\n\r\n", "name": "Chandelier Brushed Nickel", "slug": "chandelier-brushed-nickel"}}, {"pk": 54, "model": "bidding.item", "fields": {"retail_price": "195.00", "description": "Lacy Gray Messenger Diaper Bag\r\n\r\nAny mom would love this beautifully unique diaper bag with ribbon and rhinestone trim. It has convenient external elastic bottle sleeve and personal pocket and an additional internal bottle pocket.", "name": "Lacy Gray Diaper Bag", "slug": "lacy-gray-diaper-bag"}}, {"pk": 55, "model": "bidding.item", "fields": {"retail_price": "104.99", "description": "Skip Hop City Chic Diaper Tote\r\n\r\nThe Skip Hop City Chic Diaper Tote is a perfect bag for the stylish mom on the go. The exclusive removable clutch is great for quick trips or when mom just needs her essentials. Matte laminated canvas wipes clean and luxurious leather trim adds a touch of style. You can wear City Chic as a tote or attach it to the stroller. \r\n\r\nProduct Description\r\nThe chicest bag for the fashionable mom and baby! The City Chic is the perfect bag for the stylish mom on the go! The exclusive removable clutch is great for quick trips or when mom just needs her essentials. Matte laminated canvas wipes clean and luxurious leather trim adds a touch of style. You can wear City Chic as a tote or attach it to the stroller. \r\n\r\nFeatures:\r\nRemovable clutch - wear as wristlet or shoulder bag \r\nMatte laminated cotton canvas - water-resistant inside & out \r\nLuxurious leather trim \r\nZip top closure & tote strap \r\nRoomy side pockets for bottles or sippy cups \r\nCushioned changing pad \r\nAdjustable stroller attachments \r\nNickel feet keep it off the ground \r\nTote Dimensions: 16\"W x 6\"D x 10.5\"H \r\nClutch Dimensions: 11.5\"W x 0.75\"D x 6.5\"H\r\n\r\n\r\n", "name": "S.H City Chic D. Tote", "slug": "sh-city-chic-d-tote"}}, {"pk": 56, "model": "bidding.item", "fields": {"retail_price": "50.00", "description": "As seen on \"The View\", US Weekly, In Style Magazine, Parenting Magazine, TV's Extra!, and in many more fine publications. Say goodbye to flowery diaper bags... Now there's Diaper Dude! Diaper Dude is not your average diaper bag. It was designed with dad in mind. A cool, hip, funky diaper bag that comes complete with changing pad, cell phone holder and key ring for dads on the go. Diaper dude is compartmentalized and has enough space to hold those essentials needed for a day out with dad. Three large front pockets are designed for wipes, food, bibs, utensils and more. The main compartment contains a special place for diapers, changing pad and is big enough to hold a change of clothes, toys and extras. A bottle holder is at arms reach, so dad can access milk or juice at a moments notice. But most of all, Diaper Dude is form fitting to the body, comfortable, hip and affordable. And moms love wearing it too! Bag measures approx. 16\"wide and 14\"tall and 4.5\" deep. \r\n\r\nProduct Description\r\nPlay the role of Proud Papa to utmost perfection with our Diaper Dude Shoulder Diaper Bags. These stylish bags come with a super comfy across the chest design and a padded back for extra comfort. It has three exterior zip-closed pockets perfect for wipes, food, bibs, and more. The elasticized bottle pocket provides convenient access and it also comes with a large inner pocket with a special pouch for diapers. With a padded changing pad, two handy clips for keys, and a cell phone holder, you''ll be ready to take on anything your little slugger or your baby girl can throw at you! Choose from camouflage, black and brown. Each sold separately. Bag measures 16\"x14\"x3\"; sits at waist; strap adjusts from 24\" to 30\"", "name": "Diaper Dude Bag", "slug": "diaper-dude-bag"}}, {"pk": 57, "model": "bidding.item", "fields": {"retail_price": "219.95", "description": "Orion StarBlast 4.5 Equatorial Reflector Telescope\r\n\r\nConsidering how many adults have told us they love our StarBlast \"mini Dob,\" we weren't surprised that some of them suggested we offer the StarBlast optical tube on a full-size telescope mount. Sounded like a good idea to us. So here it is, the StarBlast 4.5 EQ. It's bound to become a favorite of both adults and adolescents alike. It combines the much-heralded StarBlast wide-field (f/4.0) parabolic optics with a sturdy, adjustable height EQ-1 equatorial tracking mount. So if you're an adult (or a parent) looking for an exceptional starter scope on a tracking mount, or an experienced amateur astronomer seeking a more portable alternative to your \"light bucket,\" then get a StarBlast 4.5 EQ. The name says it all!", "name": "Orion StarBlast Telescope", "slug": "orion-starblast-telescope"}}, {"pk": 58, "model": "bidding.item", "fields": {"retail_price": "219.95", "description": "Orion SkyQuest XT4.5, Classic 4.5\" Dobsonian Telescope Kit, with Eyepieces, Focuser, Finder & Software\r\n\r\nOrion’s Skyquest XT4.5 is the smallest in their Dobsonian line of telescopes that includes the B00020WZB0 XT6 , XT8 , and XT10. Newcomers to the hobby are always surprised at how large amateur telescopes are, but to experienced observers, this XT4.5 is considered a very small scope. Tiny, in fact (It’s so small, astronomers are buying them just because they think they're so cute). Make no mistake, though--the XT4.5 is a full-fledged telescope, and is a serious observing tool that could last you for years. \r\n\r\nYour money buys you a lot in this case. Included are a good-quality 4.5\" f/8 primary mirror, two eyepieces, a finder, and a CD-ROM with a stripped-down version of The Sky, a software guide to the sky. The scope comes in two cartons. One contains the optical tube, and the other is a flat-packed box containing the base, which you assemble yourself. Orion includes all the hardware and tools you need, and the instructions are well written. Allocate about 30 minutes to assemble and align everything. \r\n \r\nSee a detailed view of \r\nthe XT4.5's features \r\n\r\nThere are a couple of cost-cutting measures. The primary mirror is spherical, not parabolic (this is not likely to affect the views, however). Also, the focuser is plastic. While I’ve never seen one break, plastic focusers are by nature less robust than metal ones. Finally (and this may be the most serious concern of all), the scope is a little short for an adult. The eyepiece is only 3 feet off the ground, which may force you to stoop over (hint: try sitting on a short chair or stool while observing). On the other hand, the height is ideal for a child, and as a result, I heartily recommend this telescope for children. \r\n\r\nUnder the stars, the XT4.5 exhibits excellent performance. Once properly collimated (aligned), the optics give clear, sharp, contrasty views. I’ve spent enjoyable nights using these telescopes, both as a teaching tool and by myself. Jupiter’s cloud band and four moons are no problem to see, nor are Saturn’s rings. The Orion Nebula is a glowing fan of green gas, with a quartet of tiny stars at its core. Under dark skies (and with some diligence) the XT4.5 can even pull in some of the fainter deep sky objects, like the brighter galaxies in the Virgo Cluster. \r\n\r\nDespite the fact that I have a garage full of expensive telescopes, I never feel compromised with any of Orion’s XT scopes. As recently as a few years ago, the old adage regarding telescopes was that you must spend at least $300 to avoid buying junk. While this is still mostly true, Orion’s little XT4.5 breaks the price barrier in a big way. As long as you can deal with the short eyepiece height, it’s a great starter scope", "name": "Dobsonian Telescope Kit", "slug": "dobsonian-telescope-kit"}}, {"pk": 59, "model": "bidding.item", "fields": {"retail_price": "699.95", "description": "Orion HCCA-D5000 Mono Class D Subwoofer Car Amplifier 5000 Watts\r\n\r\n5000W HCCA High Current Competition Class D Monoblock Amplifier * RMS Power Output: 4 Ohms: 1000 watts x 1 chan. * 2 Ohms: 1600 watts x 1 chan. * 1 Ohm: 2500 watts x 1 chan. * 10dB of boost with INTELLi Q * Remote Gain capable * Selectable AUX out * Additional Power Output: 2500 Watts RMS at 1 ohm * Massive loosely-regulated MOSFET power supply * IntelliQ Bass Optimization Circuit and Remote Gain Control * Heavy Gauge Direct-wire High Current Power and Speaker Terminals * 18dB/octave Low-pass Filter * Dimensions: 22.8\"L x 10.2\"W x 2.4\"H", "name": "Orion Car Amplifier ", "slug": "orion-car-amplifier"}}, {"pk": 28, "model": "bidding.item", "fields": {"retail_price": "74.99", "description": "Philips DVP5990 HDMI 1080p Upscaling DVD Player\r\n\r\n *  Bring audio and video to life HDMI digital output with only one cable,12-bit/108MHz video processing,192kHz/24 bit audio DAC enhances analogue sound, high definition JPEG playback, progressive Scan component video for optimized image quality.\r\n    * Play all your movies and music, DivX, MP3, WMA and JPEG digital camera photos, CD, (S)VCD, DVD, DVD+R/RW, DVD-R/RW\r\n    * Picture enhancement Flip photos, Rotate, Zoom,Slideshow with MP3 playback, High Definition Resolution,\r\n    * Parental Control, On-Screen Display languages: American, Canadian French, Mexican Spanish, MM USB memory class device, rear connections,\r\n    * Power supply: 120V, 60Hz,Power consumption:12¿W,Standby power consumption:1.0 W, Included Accessories: 2 x AAA Batteries, Quick start guide, Remote Control,\r\n", "name": "Philips DVD Player", "slug": "philips-upscaling-dvd-player"}}, {"pk": 60, "model": "bidding.item", "fields": {"retail_price": "235.00", "description": "Alpine MRP-F600 - Amplifier - V-Power - 4-channel\r\n\r\nPower up your system with Alpine's V-Power amplifiers! This best selling family of amplifiers offers more choices for building the right system for you, and provides flexibility and value in an aggressive design. Alpine continues to bring you mind-blowing sound performance - only the best - so you get the sound you deserve.Want serious power for your system? While trying not to blow your budget? Go with one of the Alpine V-Power amps for unbeatable dollar-per-watt value and Alpine quality sound, along with Bass EQ for maximizing bass performance.", "name": "Alpine Amplifier  ", "slug": "alpine-amplifier"}}, {"pk": 61, "model": "bidding.item", "fields": {"retail_price": "135.33", "description": "Alpine Type-R SPR-17S - Car speaker system - 110 Watt - 2-way - component - 6.5\"\r\n\r\nThe entirely new overall design of the Alpine Type-R speakers result in shallower depth design for fitment in almost any vehicle, ultra-efficiency, less distortion, and accurate sound. Hear those extra kicks and feel lower, tight end bass in your music right from your speakers! Play it loud and experience full, superb sound quality.Some systems can get loud but sacrifice clarity. Why butcher your music? Add Type-R speakers and prepare to enjoy your music. Type-R speakers deliver solid performance - superior linearity, efficiency, clarity, and great bass response, the Type-R speakers are the ones you deserve.Experience greater detail and impact of your music with the hybrid layered-pulp with mica coating woofer cone and new 1\" ring tweeter. A new external network design with seven-level tweeter adjustment allows for precise tuning, while the hidden screw terminal gives a sleek appearance. Adjust the tuning of your speakers using the crossovers to individually perform fine adjustments of the tweeter level. Ultimately, get far more detail and bright and crisp sound reproduction for a great sounding, loud system.", "name": "Alpine Car Speaker", "slug": "alpine-car-speaker"}}, {"pk": 62, "model": "bidding.item", "fields": {"retail_price": "350.00", "description": "Alpine CD-R/-RW/MP3/AAC/WMA Receiver, CDA-9886\r\n\r\nThis is an audiophile's ideal CD player solution for their car ¿ premium quality sound Alpine delivers with modern convenience and control. Enjoy a cool blue illuminated, BioLite high definition display to view all your song information. The CDA-9886 is a robust Ai-NET head unit, so you can connect to a wide array of digital media sources and formats, including HD Radio, XM or SIRIS satellite radio, Bluetooth connectivity for hands free calling, USB mass storage devices and CD changers, for a truly integrated in-car digital experience. (Separate adapters and/or subscriptions required) Whatever your choice the CDA-9886 will make all your sources sound great using it¿s high quality 24-Bit DSP to make sure you get every musical detail from all your favorite digital media. This unit also comes with an included remote control, for extra convenience. \r\n", "name": "Alpine Receiver", "slug": "alpine-receiver"}}, {"pk": 63, "model": "bidding.item", "fields": {"retail_price": "193.99", "description": "Logitech QuickCam Vision Pro for Mac (Black)\r\n\r\nImage-Perfect Detail and Clarity for Your Mac\r\nDesigned specifically for the Mac, the QuickCam Vision Pro lets you enjoy a video calling experience that far surpasses that of other solutions--either embedded or stand-alone. It features optics by Carl Zeiss, the global leader in camera optics, for image-perfect detail and clarity. Its premium autofocus keeps images razor-sharp, even in the most extreme close-ups. The 2-megapixel sensor will let you enjoy sharper, more lifelike video calling, and RightLight 2 light correction technology adjusts intelligently to produce the best possible image, even in dim or uneven lighting. And the built-in microphone provides clear audio for voice and video conversations.", "name": "Logitech QuickCam", "slug": "logitech-quickcam"}}, {"pk": 64, "model": "bidding.item", "fields": {"retail_price": "169.00", "description": "Give your Mac the upgrades it deserves with the latest versions of the Apple software for your Mac--all in one box: Mac OS X v10.5.6 Leopard, the world's most powerful operating system; iLife '09, featuring the new iPhoto, iMovie, GarageBand, iWeb, and iDVD; and iWork '09, Apple's productivity suite including the new Pages, Numbers, and Keynote. It's the next best thing to getting a new Mac.", "name": "Mac Box Set", "slug": "mac-box-set"}}, {"pk": 65, "model": "bidding.item", "fields": {"retail_price": "499.99", "description": "Apple Mac mini MB138LL/A (1.83 GHz Intel Core 2 Duo, 1 GB RAM, 80 GB Hard Drive, Combo Drive)\r\n\r\nA great choice for home computing tasks and creating a digital media hub, Apple's Mac mini desktop PC combines design simplicity with powerful computing resources. Nicely compact at just 6.5 inches square and 2 inches high, the Mac mini offers an affordable avenue to dual-core processing power via the 1.83 GHz Intel Core 2 Duo and Apple's latest suite of digital media applications--iLife '08. It also comes with the Apple Remote and Front Row media display software, which enables you to easily play your music, enjoy photo slideshows, and watch DVDs, iMovies, music videos and television shows from across the room. \r\n\r\n\r\nInside its 2-inch-tall, 6.5-inch-square anodized aluminum enclosure, the Mac mini houses the fast Intel Core 2 Duo processor.\r\n\r\nThis Mac mini also features 1 GB of installed RAM (with a 2 GB maximum capacity), 80 GB hard drive, a combo DVD-RAM/CD-RW drive for watching DVD movie discs and burning your own mixes to CD, Gigabit Ethernet wired networking and 802.11b/g wireless LAN, and the Mac OS X v10.5 Leopard operating system. You'll have to supply your own keyboard, mouse, and display. \r\n\r\nPreinstalled with iLife '08\r\nEvery Mac mini includes iLife '08, the latest version of Apple's award-winning suite of digital media applications, with major upgrades to iPhoto, iDVD, iWeb, and GarageBand and a completely reinvented iMovie. iPhoto '08 now automatically organizes photo libraries into Events that let you more easily manage your growing photo collections, and iMovie '08 can import video from the latest AVCHD, HDV and DV camcorders, as well as from digital cameras, and displays your entire video library whether it's stored on internal or external drives. Both iPhoto and iMovie integrate seamlessly with the new .Mac Web Gallery, Apple's new service for .Mac members to instantly create and host websites for their photos and videos. \r\n\r\n\r\nThe pre-installed iLife '08 software suite includes a completely redesigned iMovie, which makes it even easier to share your videos on the Internet.\r\n\r\niLife '08 also features iWeb '08, with live web widgets such as Google Maps that let you create even more dynamic websites, and GarageBand '08, with its new Magic GarageBand feature that makes it fun and easy for both musicians and non-musicians to create great sounding songs. \r\n\r\nIntel Core 2 Duo Processor\r\nThe Intel Core 2 Duo T5600 processor has a 1.83 GHz processor speed, fast 667 MHz front-side bus (FSB), and large 2 MB L2 cache. (An L2, or secondary, cache temporarily stores data; and a larger L2 cache can help speed up your system's performance. The FSB carries data between the CPU and RAM, and a faster front-side bus will deliver better overall performance.) \r\n\r\nThe Intel Core 2 Duo's 128-bit SSE3 vector engine handles 128-bit computations in a single clock cycle, accelerating data manipulation by simultaneously applying a single instruction to multiple data. And its two execution cores are designed to share resources and conserve power, helping it to achieve higher levels of performance since it uses fewer watts", "name": "Apple Mac mini", "slug": "apple-mac-mini"}}, {"pk": 66, "model": "bidding.item", "fields": {"retail_price": "499.99", "description": "Bose CineMate digital home theater speaker system - Graphite Gray\r\n\r\nIf you\u001are just listening to sound through a TV, then you\u001are not getting the full experience. But add the high-performance audio of the CineMateTM speaker system and you\u001all complete the picture with ease. Our proprietary Articulated Array® speaker design combines with TrueSpaceTM digital processing circuitry to produce cinematic sweep from just two front speakers. You\u001all also enjoy a strong center image that locks dialogue on screen with no center channel speaker to cramp your TV\u001as style. The Acoustimass module answers the call for emphatic low notes that grab your attention. It delivers dramatic effects without audible distortion, so you can hide it almost anywhere in the room. The module also houses the amplification for the system. And all the sound seems to come from the small speakers. The CineMate speaker system offers simplified setup that can be completed in no time at all. There are just four quick connections to make, with intuitive one-way connectors eliminating the guesswork required of more complex home theater systems. A slim universal remote control operates your system and most devices attached to your TV. And, in keeping with the spirit of simplicity, proprietary Videostage® 5 decoding circuitry automatically generates as many as six independent channels of audio from non-5.1 sources. So even your VHS classics can deliver the modern presentation you expect from your new video components. The CineMate speaker system. It can make you think about home theater in a whole new way. And you\u001all never look at your TV the same way again", "name": "Bose Home Theater", "slug": "bose-home-theater"}}, {"pk": 67, "model": "bidding.item", "fields": {"retail_price": "499.99", "description": "Bose Wave Music System - Graphite Gray\r\n\r\nCD music system \r\n\r\nProduct Description\r\nThe Wave music system reproduces one-half octave lower musical notes and delivers even greater clarity and definition than the original Wave radio/CD. With its deeper tones and even more lifelike sound, you might just feel like you're sitting in the front row. Inside, our new proprietary waveguide speaker technology combines with other Bose technologies to deliver enhanced performance at all listening levels. You'll hear the same clear musical nuances whether you turn the volume up or keep it soft. You'll also enjoy the full depth and range of every vocal or instrument on MP3s, CD-R/RWs, and conventional CDs. Listen to CDs created on your computer and take advantage of the digital MP3 format for hours of uninterrupted Wave music system quality sound. The Wave music system was engineered to be delightfully easy to use. There are no visible buttons. Instead, the entire system is completely and conveniently controlled by a credit card-sized remote control. And setup couldn't be easier. The CD player, digital AM/FM tuner, amplifiers and speakers are all built-in so you can enjoy quality sound right out of the box. The large, bright display panel is easy to read and understand, prominently displaying the artist, title and album names of your suitably encoded MP3 CDs. It's also easy to enjoy the system's full, rich sound with your TV, VCR, DVD player, or computer, thanks to an auxiliary input jack. And if you want to keep the music to yourself, you can simply plug your headphones into the headphone jack. The Wave music system may look familiar, but it takes the original award-winning design of the Wave radio/CD to new levels. With its absence of buttons and a convenient slot-loaded CD player, the slim, sleek profile shines through to complement just about any room. Its lighted buttons are ideal for low-light conditions and its larger, rounded design is comfortable to hold.", "name": "Bose Music System", "slug": "bose-music-system"}}, {"pk": 68, "model": "bidding.item", "fields": {"retail_price": "249.99", "description": "Bose SoundDock digital music system for iPod (Black)\r\n\r\nThe Bose?? SoundDock?? digital music system was specifically designed to expand and enhance your enjoyment of the music stored on your iPod. Just slip it into the docking cradle for the sound quality your favorite songs deserve. The iPod charges as it plays, so you enjoy music without interruption. Its sleek, slender design, in White or Black, fits almost any room's d??cor. And the included remote lets you control the SoundDock system from across the room. Enjoy the songs on your iPod like never before. The SoundDock system is designed to play your favorite tracks with crisp clarity, allowing you to discover subtleties in your music that used to simmer beneath the surface. A host of proprietary technologies adds vitality and realism to your tracks. With Bose proprietary acoustic design, you enjoy a full, rich sound that's greater than you'd expect from a system this small. The SoundDock system is easy to operate. Just plug it in, pop in your iPod and play. Your iPod works as long as it has a dock connector on the bottom. There are no extra wires or adapters. The remote allows you to control your music at the push of a button. And a stylish, sophisticated look means it can be the center of attention or blend in wherever you place it. The SoundDock system and your iPod share a commitment to simplicity, quality and above all, music. Now just introduce them and watch this pair become best friends.", "name": "Bose iPod System", "slug": "bose-ipod-system"}}, {"pk": 69, "model": "bidding.item", "fields": {"retail_price": "349.99", "description": "Toshiba 19LV506 19-Inch 720p LCD HDTV with Built-in DVD Player (White)\r\n\r\nThe elegant design of the 19LV506 is the perfect complement to your kitchen decor, and you won't have to compromise shelf or counter space for style and performance. Multi digital tuning allows for tuning of standard cable channels as well as off-air digital broadcasts, in addition to digital \"cable-in-the-clear\" broadcasts. Using PC input, the 19LV506 can be used in conjunction with a computer, and the A/V input, HDMI and component input can be used for gaming and receiving HD broadcasts. The built-in DVD player makes this LCD HDTV a convenient and feature-rich viewing solution.", "name": "Toshiba HDTV", "slug": "toshiba-hdtv"}}, {"pk": 70, "model": "bidding.item", "fields": {"retail_price": "129.99", "description": "Axion AXN-8701 7-Inch Widescreen Portable Handheld TV with Built-In Tuner (Black)\r\n\r\nAxion AXN-8701 widescreen portable handheld TV gives you the ability to enjoy your favorite television programs anywhere in your home – even away from home. Use it to watch TV while others are occupying the main TV or the room where it is located. Watch the morning news without having to get out of bed, use it to occupy the kids in the car, or while sun bathing in the back yard. The portable TV has a 7-inch LCD widescreen that offers a high-resolution, high-brightness display. The built-in ATSC/NTSC tuner for both analog and digital channels and the built-in antenna enables you to receive crisp reception of your favorite channels - and it will work after the digital to analog transition on February 19, 2009. The AXN-8701 comes with an additional external antenna to help receive stronger reception. The portable player features A/V input for external audio/video sources. The built-in twin speaker system allows for multiple people to watch at once or you can plug your headphones into the headphone jack to enjoy your favorite programs without disturbing those around you. The rechargeable Lithium-Polymer battery offers you a sufficient amount of time to watch several of your favorite shows without having to frequently recharge the battery. Portable TV includes an AC power adapter as well as a car adaptor (used by plugging into the cigarette lighter of your car) so you will be able to have unlimited use on a long road trip. Remote control, A/V cables and instruction manual are also included with portable TV player. \r\n\r\nProduct Description\r\nPRODUCT FEATURES:7\" widescreen LDC mobile TV with hi-resolution and hi-brightnessBuild in NTSC/ATSC tuner for both analog and digital channelsBrightness adjustableBuild-in antenna allows easy repositioning for receptionA/V input for external audio/video sourcesBuild-in speakerBuild-in rechargeable lithium-polymer batteryCard style remoter controlHeadphone jack and volume control", "name": "Axion Portable TV", "slug": "axion-portable-tv"}}, {"pk": 71, "model": "bidding.item", "fields": {"retail_price": "129.95", "description": "Coby TFTV1022 10.2-Inch LCD TV\r\n\r\nFor all your digital display needs, Coby's TF-TV1022 10.2\" Widescreen LCD Digital TV/Monitor is the perfect solution. A 10.2\" widescreen TFT LCD color display brings bright color to computer applications, video games, and television broadcasts. Available AV input jacks allow for easy connection of media players, DVR/VCRs, video games and more. \r\n\r\nFull-range stereo speakers (6W) Digital comb filter and noise reduction V-chip parental control, Closed-Caption, and Electronic Program Guide support Multi-language on-screen display Wall-mountable design (VESA 75mm x 75mm) Display Resolution - 800 x 480 Contrast Ratio - 400 - 1 Brightness - 300 cd/m^2 Pixel Response - 30 ms DTV Input Format - 480i, 480p, 720p, 1080i Video System - ATSC/QAM/NTSC Menu Language Support - English, Spanish, French Additional Functions - MTS (Stereo/SAP/Mono); Sleep Timer Audio Input - RCA Composite Audio; 3.5mm Audio Audio Output - Integrated Stereo Speakers (6W); 3.5mm Headphone Video Input - Coaxial Antenna; RCA Composite Video; 15-pin PC VGA Power - Main Unit - AC 100-240V; Remote - 2 x 1.5V AAA Unit Dimension (WHD) - 12.21 x 12.19 x 5.24 AV Cable Remote Control 2 x 1.5V AAA Batteries 100-240V UL AC Adapte", "name": "Coby LCD TV", "slug": "coby-lcd-tv"}}, {"pk": 72, "model": "bidding.item", "fields": {"retail_price": "399.99", "description": "Palm Tungsten E2 Handheld\r\n\r\nWherever your life is going, this is the perfect handheld to take along for the ride. The sleek, stylishly designed Tungsten E2 handheld from palmOne brings your entire world to life. Your calendar, contacts, documents, presentations, photos and videos look sharper and more colorful. But just as important, its new flash memory keeps all that information safe -- even if you don't have time to recharge.\r\n\r\n\r\n\r\nSee a detailed digram of the E2's features.\t\r\n\r\n\r\n\r\nOf course, it wouldn't be a palmOne handheld if we didn't push the boundaries of what a handheld can do. That's why we included Bluetooth wireless technology for wireless connectivity. Now working and communicating will be that much easier. Taking work to go? View and even edit spreadsheets and word processing documents right on your handheld. Plus you can sync your calendar and contacts from Outlook. And don't forget to grab your MP3 tunes. You're going places.\r\n\r\nBrighter, richer color display: See your information clearly indoors and out. Brighter display, better color saturation brings photos and videos to life.\r\n\r\nNon-volatile, flash memory: There's more than enough room to hold your calendar, contacts, applications, photos, and even your spreadsheets or presentations. And because it's flash memory, the information on your\r\nhandheld is protected -- even if you're on the go and don't have time to recharge.\r\n\r\nBuilt-In Bluetooth: Stay connected. With built-in Bluetooth wireless technology, you can synchronize with your\r\ndesktop without wires getting in the way. Use your Tungsten E2 handheld with a compatible\r\nphone to send email and text messages, or to check news headlines on the Web.\r\n\r\nDocuments To Go: Productivity in your pocket. The Tungsten E2 comes with Documents To Go, which lets you\r\ncarry Word, Excel, and PowerPoint files-so you can be more productive wherever you are. And with a simple conversion step, you can even view Acrobat PDFs. \r\n\r\nProduct Description\r\nLife isn't stagnant - it moves constantly. Wherever your life is going, the sleek, stylishly designed Tungsten E2 handheld from palmOne is the perfect handheld to take along for the ride. With a brighter, richer color screen, it brings your calendar, contacts, documents and presentations, photos and videos to life. Just as important, its flash memory keeps all that information safe even if you don't have time to recharge. There's even built-in Bluetooth technology for wireless connectivity. Taking work to go? Create and edit Word and Excel documents, view PowerPoint presentations and PDF files. Easily sync your calendar and contacts from Outlook. And grab your MP3 tunes, too. It's one portable device you don't want to be without. Tungten E2 helps your life move where you want it to go. Read and draft email when you're out of the office with VersaMail application. Sync and send when you're back at your computer MultiMediaCard, SD and SDIO expansion-card compatible with built-in expansion slot. This enables storage of MP3 files for play. Also id your digital-camera uses SD memory for picture storage, your pictures can be easily transferred to the Tungsten E2 for display. Listen with headphones (sold separately) using the built-in stereo headphone jack Track appointments To Do Lists Calendar functions Long life rechargeable battery Includes Stylus, Power Adapter, Flip Cover", "name": "Palm Tungsten", "slug": "palm-tungsten"}}, {"pk": 73, "model": "bidding.item", "fields": {"retail_price": "329.99", "description": "HP iPAQ 111 Classic Handheld (FA979AA#ABA) (110 Series)\r\n\r\nThe HP iPAQ 111 Classic Handheld helps you keep your life organized on the go with easy access to your calendar, contacts, and tasks. If you have some down time, use the iPAQ to watch videos, listen to music, or play games. At just half an inch thick, the iPAQ will easily travel with you. The iPAQ 111 runs Microsoft Windows Mobile 6 Classic OS and features a bright, crisp, and easy-to-read 3.5-inch, 320 by 240 touchscreen with LED backlight. The iPAQ 111 employs the powerful new Marvell PXA310 624 MHz processor and has 64 MB SDRAM main memory and 256 MB flash ROM, so there is plenty of space for all your applications to run snappily. With Microsoft Office Mobile, you'll be able to work on all your documents and files no matter where you are. Microsoft Office Mobile includes Word, Excel, PowerPoint, and Outlook. You can even view PDF documents.\r\n\r\nNever be late again to your appointments as your calendar and contact info will be handy. With built-in Wi-Fi, you can also check your email at any hotspot to make sure there hasn't been a change of plans. Bluetooth is also supported, allowing you to go online and connect to your Internet-enabled mobile phone if Wi-Fi is unavailable (requires Bluetooth-enabled phones with supporting Internet service plan). Bluetooth accessories such as headphones and keyboards can also be connected for added functionality and ease of use. The HP iPAQ 111 Classic Handheld is backed by a 1-year warranty.\r\n\r\nWhat's in the Box\r\niPAQ classic handheld 100 series, standard battery, stylus, AC adapter with power cord, mini USB synchronization/charge cable, slip case, documentation, and HP iPAQ companion CD. \r\n\r\nProduct Description\r\nDesigned to help keep your action-packed life in balance, iPAQ 110 Classic Handheld makes an excellent - and affordable - companion to your cell phone. This slim, stylish organizer also lets you go online with Wi-Fi to stay in touch and keep your calendar, contacts, and tasks up to date.", "name": "HP Classic Handheld ", "slug": "hp-classic-handheld"}}, {"pk": 74, "model": "bidding.item", "fields": {"retail_price": "259.98", "description": "Acer Aspire ONE 8.9\" Netbook in Sapphire Blue\r\n\r\nhe Wind, an acronym for \"Wi-Fi Network Device,\" features a speedy and energy-efficient Intel Atom 1.6GHz Processor to provide longer operation hours and better mobile lifestyle. This notebook, or \"netbook\" is lightweight and ultra-portable, measuring about 7 inches wide by 10.23 inches long, and weighing just 2.6 pounds. Being small doesn't mean ultra-small keyboard, the Wind features an ergonomically designed keyboard that is only 20% smaller than a full sized notebook keyboard, with keys spaced a comfortable 0.68 inches apart. The Wind comes equipped with a 10\" backlit LED screen that provides superior color quality and brightness giving you better comfort while reading reports, watching online videos and viewing photos. In addition, the 1024 x 600 screen resolution can fully display web pages, which makes it ideal for Internet browsing. With the 802.11b/g/n wireless built-in, you can enjoy the convenience of accessing the Internet anywhere and video chat with family and friends with the built-in 1.3 Megapixel Web camera and microphone. Another wireless feature that comes with the Wind is Bluetooth, this enables you to wireless connect to headphones, or other Bluetooth devices making it more convenient by not carrying around a bunch of tangled cords. With the Wind netbook weighting less than 3 pounds, makes it a great second computer to use at school, work and to take on vacations. 10 WSVGA (1024 x 600) LED Backlit Display Two internal Speakers Built-in 1.3 Megapixel Web camera and Microphone Facial Recognition Software for Security Built-in 802.11b/g/n Wireless 10/100 Ethernet LAN Integrated Bluetooth 4-in-1 Card Reader - SD, Multimedia Card, Memory Stick, Memory Stick Pro 3 x USB 2.0, Headphone out; Microphone-in, VGA, RJ-45 Approximate Unit Dimensions - 10.23 (L) x 7.08 (D) x 1.24 (H) Approximate Unit Weight - 2.6 Pounds \r\n\r\n\r\nAdorable, Compact, and AFFORDABLE!!!", "name": "Acer Aspire ONE 8.9", "slug": "acer-aspire-one-89"}}, {"pk": 75, "model": "bidding.item", "fields": {"retail_price": "84.98", "description": "ALDO Samii Pointed-toe Booty Pumps\r\n\r\nMade famous by Hollywood, it's the top trendy bootie pump with towering heel, almond toe and patent leather. Approximate heel height is 4.6 inches.", "name": "ALDO Samii Pointed", "slug": "aldo-samii-pointed"}}, {"pk": 76, "model": "bidding.item", "fields": {"retail_price": "1259.00", "description": "Redesigned with a precision unibody enclosure crafted from a single block of aluminum, the MacBook is thinner and lighter than its predecessor as well as stronger and more durable. But Apple didn't stop innovating with the body's design. The MacBook also includes a new 13.3-inch, LED-backlit glass display (instead of an LCD panel) and a glass trackpad that doesn't include a button (for larger tracking area) and features includes Apple's Multi-Touch technology. \r\n\r\n\r\nThe redesigned MacBook (see larger version). \r\nUnder the hood, the MacBook is powered by a powerful 2.0 GHz Intel Core 2 Duo processor (with 3 MB L2 cache and 1066 MHz front-side bus), which runs applications faster and more efficiently as well as helps to reduce power requirements and save on battery life. And the MacBook features the integrated NVIDIA GeForce 9400M graphics processor, which delivers outstanding 3D game play with up to five times faster graphics performance than the previous generation. \r\n\r\nIt's pre-loaded with Apple's Mac OS X 10.5 Leopard operating system, which enables easy backup of your most important data via Time Machine, a redesigned desktop that helps eliminate clutter. It also comes with the iLife '08 suite of applications--including iPhoto, iMovie, Garageband, and iTunes--and the newest version of the fast-loading Safari web browser. Other hardware features include a 160 GB hard drive, 2 GB of installed RAM (which can be upgraded to 4 GB), an 8x combo Superdrive (for burning dual-layer DVDs as well as CDs), built-in Gigabit Ethernet for high-speed networking, Bluetooth 2.1+EDR (Enhanced Data Rate), and Mini DisplayPort video output (for DVI and VGA connections). \r\n", "name": "Apple Macbook 13.3", "slug": "apple-macbook-133"}}, {"pk": 77, "model": "bidding.item", "fields": {"retail_price": "79.99", "description": "Apple iPod shuffle 4 GB Black (3rd Generation)\r\n\r\nThe third-generation iPod shuffle is the talk of the music world. Not just because it's incredibly small--half the size of the previous generation. And not just because it holds up to 1,000 songs and supports multiple playlists. It's the talk of the town because it's the only music player in the world that talks to you. The new VoiceOver feature lets iPod shuffle tell you what song is playing and who's performing it. It also tells you the names of your playlists. With VoiceOver--and with the controls conveniently located on the earbud cord--it's even easier to navigate your music. You can do it without taking your eyes off your run, your ride, or whatever you're doing.", "name": "iPod shuffle 4 GB Black ", "slug": "ipod-shuffle-4-gb-black"}}, {"pk": 78, "model": "bidding.item", "fields": {"retail_price": "79.99", "description": "Apple iPod shuffle 4 GB Silver (3rd Generation)\r\n\r\nThe third-generation iPod shuffle is the talk of the music world. Not just because it's incredibly small--half the size of the previous generation. And not just because it holds up to 1,000 songs and supports multiple playlists. It's the talk of the town because it's the only music player in the world that talks to you. The new VoiceOver feature lets iPod shuffle tell you what song is playing and who's performing it. It also tells you the names of your playlists. With VoiceOver--and with the controls conveniently located on the earbud cord--it's even easier to navigate your music. You can do it without taking your eyes off your run, your ride, or whatever you're doing.", "name": "iPod shuffle 4 GB Silver ", "slug": "ipod-shuffle-4-gb-silver"}}, {"pk": 79, "model": "bidding.item", "fields": {"retail_price": "284.95", "description": "Apple iPod touch 16 GB (2nd Generation)\r\n\r\nThe iPod touch has always been an amazing iPod. And with its groundbreaking technologies--including a Multi-Touch screen, the accelerometer, and 3D graphics--and access to hundreds of games, iPod touch puts an amazing gaming experience in the palm of your hand. It comes in 8 GB, 16 GB, and 32 GB models with new volume controls and a built-in speaker. Play hours of music. Create a Genius Playlist of songs that go great together. Watch a movie. Surf the web. View rich HTML email. Find your location and get directions with Google Maps. Browse YouTube videos. And shop the App Store for games and applications.\r\n\r\nMusic\r\nMusic on iPod touch not only sounds amazing, it looks amazing, too.\r\n\r\nTouch Your Music\r\nRemember what it felt like to flip through your CD or record collection? Cover Flow brings that feeling back. Just turn iPod touch on its side and flick through your music to find the album you want to hear. Tap the cover to flip it over and display a track list. Tap again to start the music. Even view the lyrics while you're listening.\r\n\r\nA Musical Genius\r\nSay you're listening to a song you really like and want to hear other tracks that go great with it. The new Genius feature finds the songs in your library that go great together and makes a Genius Playlist for you. You can listen to the playlist right away, save it for later, or even refresh it and give it another go. Count on Genius to create a mix you wouldn't have thought of yourself.\r\n\r\nFill It Up\r\nFill up your iPod touch with audio and video from your iTunes library. All you have to do is choose the playlists, videos, and other content you want to sync, and iTunes does the rest.\r\n\r\nMovies and TV Shows\r\nMovies and TV shows have never looked this good on a portable device.\r\n\r\nEverything's a Must-see\r\nCarry hours of video with you, and watch it on a crisp, clear 3.5-inch widescreen color display. Need ideas? From Hollywood blockbusters to independent favorites, there's something for everyone at the iTunes Store. Download and watch movies with a few clicks. Prefer TV shows? Buy a single episode or an entire season's worth all at once.\r\n\r\nIn Control\r\nWhile watching your video, tap the display to bring up the onscreen controls. You can play/pause, view by chapter, and adjust the volume. You also can use the new volume controls on the left side of iPod touch. Want to switch between widescreen and full screen? Simply tap the display twice.\r\n\r\nSync and Go\r\nNeed some entertainment for your next flight or road trip? With iTunes on your Mac or PC, you can sit at your computer and choose the movies and TV shows you want to sync to your iPod touch.\r\n\r\nGames\r\nWith its groundbreaking technologies, iPod touch puts an amazing gaming experience in the palm of your hand.\r\n\r\nGet in the Game\r\nDevelopers all over the world are creating exciting games unlike anything you've ever seen on an iPod or mobile device. Many games come alive with stunning 3D graphics and immerse you in the action with the advanced technologies in iPod touch. There's even a built-in speaker, so you can hear all the action.\r\n\r\nFingertip Control\r\nMany games for iPod touch use Multi-Touch to give you precise, fingertip control over game elements. Use your finger to drag your pieces around the board in chess or dice games. Or pinch to enlarge or shrink your view, rotate your character left or right, or just tap to make a selection.\r\n\r\nTilt, Turn, and Go\r\nThe built-in accelerometer actually responds to your movements, so you can tilt and turn your iPod touch to control the action. It's perfect for racing games--where your entire iPod touch acts as a steering wheel--and for tap-and-tilt games like Super Monkey Ball, in which your character rolls to your movements.\r\n\r\n", "name": "Apple iPod touch 16 GB ", "slug": "apple-ipod-touch-16-gb"}}, {"pk": 80, "model": "bidding.item", "fields": {"retail_price": "229.99", "description": "Apple iPod touch 8 GB (2nd Generation)\r\n\r\nThe iPod touch has always been an amazing iPod. And with its groundbreaking technologies--including a Multi-Touch screen, the accelerometer, and 3D graphics--and access to hundreds of games, iPod touch puts an amazing gaming experience in the palm of your hand. It comes in 8 GB, 16 GB, and 32 GB models with new volume controls and a built-in speaker. Play hours of music. Create a Genius Playlist of songs that go great together. Watch a movie. Surf the web. View rich HTML email. Find your location and get directions with Google Maps. Browse YouTube videos. And shop the App Store for games and applications.", "name": "Apple iPod touch 8 GB", "slug": "apple-ipod-touch-8-gb"}}, {"pk": 81, "model": "bidding.item", "fields": {"retail_price": "129.99", "description": "Axion AXN-8701 7-Inch Widescreen Portable Handheld TV with Built-In Tuner (Black)\r\n\r\nAxion AXN-8701 widescreen portable handheld TV gives you the ability to enjoy your favorite television programs anywhere in your home – even away from home. Use it to watch TV while others are occupying the main TV or the room where it is located. Watch the morning news without having to get out of bed, use it to occupy the kids in the car, or while sun bathing in the back yard. The portable TV has a 7-inch LCD widescreen that offers a high-resolution, high-brightness display. The built-in ATSC/NTSC tuner for both analog and digital channels and the built-in antenna enables you to receive crisp reception of your favorite channels - and it will work after the digital to analog transition on February 19, 2009. The AXN-8701 comes with an additional external antenna to help receive stronger reception. The portable player features A/V input for external audio/video sources. The built-in twin speaker system allows for multiple people to watch at once or you can plug your headphones into the headphone jack to enjoy your favorite programs without disturbing those around you. The rechargeable Lithium-Polymer battery offers you a sufficient amount of time to watch several of your favorite shows without having to frequently recharge the battery. Portable TV includes an AC power adapter as well as a car adaptor (used by plugging into the cigarette lighter of your car) so you will be able to have unlimited use on a long road trip. Remote control, A/V cables and instruction manual are also included with portable TV player. \r\n\r\nProduct Description\r\nPRODUCT FEATURES:7\" widescreen LDC mobile TV with hi-resolution and hi-brightnessBuild in NTSC/ATSC tuner for both analog and digital channelsBrightness adjustableBuild-in antenna allows easy repositioning for receptionA/V input for external audio/video sourcesBuild-in speakerBuild-in rechargeable lithium-polymer batteryCard style remoter controlHeadphone jack and volume control", "name": "Axion AXN-8701 7-Inch", "slug": "axion-axn-8701-7-inch"}}, {"pk": 82, "model": "bidding.item", "fields": {"retail_price": "18.88", "description": "The popular and fun anime TV series \"Bakugan Battle Brawlers\" has spawned this strategic game that pits a variety of \"Bakugan warriors\" -- such as \"Juggernoids,\" \"Fear rippers,\" and \"Robatallians\" -- against each other for points. With this Bakugan Battle Pack, kids 4 and above will enjoy the challenge of earning points by rolling their Bakugan (or shooting them from a launcher) onto magnetic cards where the plastic spheres burst open to reveal the fearsome warrior apparatus inside. Kids will also love the way the Bakugan transform suddenly into warrior mode, and fans of the show will have an especially good time with the game.\r\n\r\n Ready, Set, Play!\r\nThe mission of Bakugan game play is to battle against other Bakugan to win the points awarded on the cards by getting your Bakugan to land on card. Players will love pretending to be one of the various characters in the show, such as the fiery 12-year-old leader \"Dan\" or the wise \"Marucho,\" and they gain a deeper understanding of the cards and warriors as they play.\r\n\r\nThe Battle Pack includes instructions, making it an ideal way for newbies to get started with this fun and exciting game. The game itself is fairly straightforward, but if your child has never played before, you might have to help him or her to understand the rules -- after reading and understanding them yourself. While some of the plastic Bakugan pieces are small and could easily get lost, others, like the Bakugan Deka, are as big as a softball.\r\n\r\nIf your child is already a Bakugan fan, the Battle Pack is a good investment. This set comes with six randomly selected Bakugan and eight magnetic cards. Your child will love how this set dramatically increases their collection of Bakugan! He or she can also use the Battle Pack to play with his friends who might not have any Bakugan of their own.\r\n\r\nExciting Magnetic Action\r\nThe Bakugan come in lots of colors and varieties that make them fun to collect and trade. Most of them are pocket-sized and easy for your child to carry around and bring over to their friend's houses. Having a magnet that activates the warriors is a clever idea that adds excitement to the game. The Bakugan Launcher (sold separately) is a great accessory, with three shooting modes (\"curve,\" \"angle, and \"distance\"), but it doesn't come with any instructions.\r\n\r\nRoom for the Imagination\r\nWe like that this that this game combines skill (aiming your Bakugan) with strategy (placement of the cards). We also enjoyed the way the warriors pop open on the magnetic cards -- although sometimes they do it even when they don't land on the cards. Being unfamiliar with the TV show, we felt a little lost at first in the world of Bakugan. But with the help of the colorful, animated Bakugan Web site, we got the gist of what the game is about and how to play. Our attempts to fire the launcher proved somewhat difficult and instructions would have helped. But the launcher isn't necessary. Kids can simply roll the Bakugan like marbles for a fun and action-packed game with their friends.\r\n\r\nWhat's in the Box\r\nSix Bakugan, eight metal cards, and instructions.\r\n\r\nProduct Description\r\n\r\nThis Bakugan Battlepack Teal and Red Set has small spheres that magnetically morph into powerful Bakugan warriors when they roll onto the real metal gate cards. Use strategy to place your metal gate cards effectively as each cards affects the battle differently. Then master you precision shooting skills to roll your Bakugan into battle and win.", "name": "Bakugan", "slug": "bakugan"}}, {"pk": 84, "model": "bidding.item", "fields": {"retail_price": "2000.00", "description": "Prada Hangbag", "name": "Prada Hangbag", "slug": "Pradahangbag"}}, {"pk": 86, "model": "bidding.item", "fields": {"retail_price": "229.99", "description": "Technical Details\r\nGPS system preloaded with City Navigator North America NT \r\n4.3-inch touchscreen display with 2D/3D mapping perspective \r\nTurn-by-turn directions with voice guidance and text to speech \r\nRechargeable lithium-ion battery makes it convenient for navigation by car or foot \r\nIncludes JPEG picture viewer, world travel clock with time zones, currency converter, measurement converter, calculator and more ", "name": "Garmin Nuvi", "slug": "Garmin"}}, {"pk": 83, "model": "bidding.item", "fields": {"retail_price": "15000.00", "description": "Rolex original", "name": "Rolex", "slug": "Rolex"}}, {"pk": 87, "model": "bidding.item", "fields": {"retail_price": "78.00", "description": "PRODUCT INFORMATION:\r\nThe simple and spacious Troop Messenger is great for travels or everyday use.\r\nMessenger style cross body bag made of canvas.\r\nHolds your personal technology, a magazine and file folders.\r\nSingle adjustable crossbody strap. Cross body drop: 22\" length.\r\nFront and rear exterior slip pocket.\r\nFlat bottom.\r\nTop flap over an inside hidden magnetic closure.\r\nInterior lining with a back wall zip pocket and multifunctional slip pockets.\r\nDimensions: 16\" wide x 5\" deep x 13.5\" high.\r\n42.00 oz.", "name": "FOSSIL TROOP EAST/WEST MESSENGER", "slug": "fossil-troop-eastwest-messenger"}}, {"pk": 5, "model": "bidding.item", "fields": {"retail_price": "1868.98", "description": "Redesigned with a precision unibody enclosure crafted from a single block of aluminum, the MacBook Pro is thinner and lighter than its predecessor as well as stronger and more durable. But Apple didn't stop innovating with the body's design. The MacBook Pro also includes a new 15-inch, LED-backlit glass display (instead of an LCD panel) and a glass trackpad that doesn't include a button (for larger tracking area) and features includes Apple's Multi-Touch technology. \r\n\r\n\r\nThe redesigned MacBook Pro (see larger version). \r\nUnder the hood, the MacBook Pro is powered by a powerful 2.4 GHz Intel Core 2 Duo processor (with 3 MB L2 cache and 1066 MHz front-side bus), which runs applications faster and more efficiently as well as helps to reduce power requirements and save on battery life. And the MacBook Pro includes two video processors for ultimate flexibility: NVIDIA GeForce 9400M integrated graphics for great everyday performance and NVIDIA 9600M GT discrete graphics for fast, smooth video--perfect for 3D gaming.\r\n\r\nIt's pre-loaded with Apple's Mac OS X 10.5 Leopard operating system, which enables easy backup of your most important data via Time Machine, a redesigned desktop that helps eliminate clutter. It also comes with the iLife '08 suite of applications--including iPhoto, iMovie, Garageband, and iTunes--and the newest version of the fast-loading Safari web browser. Other hardware features include a 250 GB hard drive, 2 GB of installed RAM (which can be upgraded to 4 GB), an 8x combo Superdrive (for burning dual-layer DVDs as well as CDs), built-in Gigabit Ethernet for high-speed networking, Bluetooth 2.1+EDR (Enhanced Data Rate), FireWire 800 port, Mini DisplayPort video output (for DVI and VGA connections), and an ExpressCard/34 expansion card slot for expansion solutions such as 3G wireless networking.\r\n\r\n", "name": "Apple MacBook Pro 15.4\"", "slug": "apple-macbook-pro-154"}}, {"pk": 1, "model": "bidding.itemimage", "fields": {"item": 1, "image": "items/Picture_1.png"}}, {"pk": 2, "model": "bidding.itemimage", "fields": {"item": 2, "image": "items/kindle.jpg"}}, {"pk": 3, "model": "bidding.itemimage", "fields": {"item": 3, "image": "items/ipodtouch.jpg"}}, {"pk": 4, "model": "bidding.itemimage", "fields": {"item": 4, "image": "items/52hdtv.jpg"}}, {"pk": 5, "model": "bidding.itemimage", "fields": {"item": 4, "image": "items/52hdtv1.jpg"}}, {"pk": 7, "model": "bidding.itemimage", "fields": {"item": 5, "image": "items/Macbook15.4.jpg"}}, {"pk": 8, "model": "bidding.itemimage", "fields": {"item": 6, "image": "items/betsey1.jpg"}}, {"pk": 9, "model": "bidding.itemimage", "fields": {"item": 7, "image": "items/wii.jpg"}}, {"pk": 10, "model": "bidding.itemimage", "fields": {"item": 8, "image": "items/XBOX_360_Elite_GS_120GB.JPG"}}, {"pk": 11, "model": "bidding.itemimage", "fields": {"item": 9, "image": "items/LGPRADA.jpeg"}}, {"pk": 12, "model": "bidding.itemimage", "fields": {"item": 10, "image": "items/retromixer.jpg"}}, {"pk": 13, "model": "bidding.itemimage", "fields": {"item": 11, "image": "items/garminnuvi760.jpg"}}, {"pk": 14, "model": "bidding.itemimage", "fields": {"item": 12, "image": "items/logitechsystem.jpg"}}, {"pk": 15, "model": "bidding.itemimage", "fields": {"item": 13, "image": "items/mortalcombatvscapcom.jpg"}}, {"pk": 16, "model": "bidding.itemimage", "fields": {"item": 14, "image": "items/liedetector.jpg"}}, {"pk": 17, "model": "bidding.itemimage", "fields": {"item": 15, "image": "items/greenlazer.jpg"}}, {"pk": 18, "model": "bidding.itemimage", "fields": {"item": 16, "image": "items/laser.jpg"}}, {"pk": 19, "model": "bidding.itemimage", "fields": {"item": 16, "image": "items/laser1.jpg"}}, {"pk": 20, "model": "bidding.itemimage", "fields": {"item": 17, "image": "items/minicam.jpg"}}, {"pk": 21, "model": "bidding.itemimage", "fields": {"item": 18, "image": "items/wirelesscamerasystem.jpg"}}, {"pk": 22, "model": "bidding.itemimage", "fields": {"item": 19, "image": "items/spycam.jpg"}}, {"pk": 23, "model": "bidding.itemimage", "fields": {"item": 20, "image": "items/metaldetector.jpg"}}, {"pk": 24, "model": "bidding.itemimage", "fields": {"item": 21, "image": "items/duplicator.jpg"}}, {"pk": 25, "model": "bidding.itemimage", "fields": {"item": 22, "image": "items/dvdrecorder.jpg"}}, {"pk": 26, "model": "bidding.itemimage", "fields": {"item": 23, "image": "items/toshibadvdr.jpg"}}, {"pk": 27, "model": "bidding.itemimage", "fields": {"item": 24, "image": "items/panasonicbrdp.jpg"}}, {"pk": 28, "model": "bidding.itemimage", "fields": {"item": 25, "image": "items/samsungbrp.jpg"}}, {"pk": 29, "model": "bidding.itemimage", "fields": {"item": 26, "image": "items/sonybrp.jpg"}}, {"pk": 30, "model": "bidding.itemimage", "fields": {"item": 27, "image": "items/sonydvdportableplayer.jpg"}}, {"pk": 31, "model": "bidding.itemimage", "fields": {"item": 28, "image": "items/philipsdvdplayer.jpg"}}, {"pk": 32, "model": "bidding.itemimage", "fields": {"item": 29, "image": "items/samsungdvdp.jpg"}}, {"pk": 33, "model": "bidding.itemimage", "fields": {"item": 30, "image": "items/projector.jpg"}}, {"pk": 34, "model": "bidding.itemimage", "fields": {"item": 31, "image": "items/optomaprojector.jpg"}}, {"pk": 35, "model": "bidding.itemimage", "fields": {"item": 32, "image": "items/infocusprojector.jpg"}}, {"pk": 36, "model": "bidding.itemimage", "fields": {"item": 33, "image": "items/siriusud.jpg"}}, {"pk": 37, "model": "bidding.itemimage", "fields": {"item": 34, "image": "items/siriusstiletto.jpg"}}, {"pk": 38, "model": "bidding.itemimage", "fields": {"item": 35, "image": "items/siriushome.jpg"}}, {"pk": 39, "model": "bidding.itemimage", "fields": {"item": 36, "image": "items/siriussportster.jpg"}}, {"pk": 40, "model": "bidding.itemimage", "fields": {"item": 37, "image": "items/cakedecorating.jpg"}}, {"pk": 41, "model": "bidding.itemimage", "fields": {"item": 38, "image": "items/beginnerairbrush.jpg"}}, {"pk": 42, "model": "bidding.itemimage", "fields": {"item": 39, "image": "items/airbrush.jpg"}}, {"pk": 43, "model": "bidding.itemimage", "fields": {"item": 40, "image": "items/artset.jpg"}}, {"pk": 44, "model": "bidding.itemimage", "fields": {"item": 41, "image": "items/5knife.jpg"}}, {"pk": 45, "model": "bidding.itemimage", "fields": {"item": 42, "image": "items/oilpainters.jpg"}}, {"pk": 46, "model": "bidding.itemimage", "fields": {"item": 43, "image": "items/easel.jpg"}}, {"pk": 47, "model": "bidding.itemimage", "fields": {"item": 44, "image": "items/scrapbookfactory.jpg"}}, {"pk": 48, "model": "bidding.itemimage", "fields": {"item": 45, "image": "items/cheffoodchopper.jpg"}}, {"pk": 49, "model": "bidding.itemimage", "fields": {"item": 46, "image": "items/crib.jpg"}}, {"pk": 50, "model": "bidding.itemimage", "fields": {"item": 47, "image": "items/cribsafari.jpg"}}, {"pk": 51, "model": "bidding.itemimage", "fields": {"item": 48, "image": "items/comforter.jpg"}}, {"pk": 52, "model": "bidding.itemimage", "fields": {"item": 49, "image": "items/chocoduvet.jpg"}}, {"pk": 53, "model": "bidding.itemimage", "fields": {"item": 50, "image": "items/bluecover.jpg"}}, {"pk": 54, "model": "bidding.itemimage", "fields": {"item": 51, "image": "items/chandelier.jpg"}}, {"pk": 55, "model": "bidding.itemimage", "fields": {"item": 52, "image": "items/chandeliermini.jpg"}}, {"pk": 56, "model": "bidding.itemimage", "fields": {"item": 53, "image": "items/chandeliernick.jpg"}}, {"pk": 57, "model": "bidding.itemimage", "fields": {"item": 54, "image": "items/diaperbag.jpg"}}, {"pk": 58, "model": "bidding.itemimage", "fields": {"item": 55, "image": "items/diaperbagcity.jpg"}}, {"pk": 59, "model": "bidding.itemimage", "fields": {"item": 56, "image": "items/diaperbagdude.jpg"}}, {"pk": 60, "model": "bidding.itemimage", "fields": {"item": 57, "image": "items/telescope.jpg"}}, {"pk": 61, "model": "bidding.itemimage", "fields": {"item": 58, "image": "items/telescopedobsonian.jpg"}}, {"pk": 62, "model": "bidding.itemimage", "fields": {"item": 59, "image": "items/caramp.jpg"}}, {"pk": 63, "model": "bidding.itemimage", "fields": {"item": 60, "image": "items/alpineamp.jpg"}}, {"pk": 64, "model": "bidding.itemimage", "fields": {"item": 61, "image": "items/alpine_speaker.jpg"}}, {"pk": 65, "model": "bidding.itemimage", "fields": {"item": 62, "image": "items/alpine_cdr_receiver.jpg"}}, {"pk": 66, "model": "bidding.itemimage", "fields": {"item": 63, "image": "items/logitech_quickcam.jpg"}}, {"pk": 67, "model": "bidding.itemimage", "fields": {"item": 64, "image": "items/mac_box.jpg"}}, {"pk": 68, "model": "bidding.itemimage", "fields": {"item": 65, "image": "items/apple_mac_mini.jpg"}}, {"pk": 69, "model": "bidding.itemimage", "fields": {"item": 66, "image": "items/bose_digital_home.jpg"}}, {"pk": 70, "model": "bidding.itemimage", "fields": {"item": 67, "image": "items/Bose_wave.jpg"}}, {"pk": 71, "model": "bidding.itemimage", "fields": {"item": 68, "image": "items/bose_sound_dock.jpg"}}, {"pk": 72, "model": "bidding.itemimage", "fields": {"item": 69, "image": "items/toshiba_lcd.jpg"}}, {"pk": 73, "model": "bidding.itemimage", "fields": {"item": 70, "image": "items/Axion_7_inch.jpg"}}, {"pk": 74, "model": "bidding.itemimage", "fields": {"item": 71, "image": "items/coby_tftv.jpg"}}, {"pk": 75, "model": "bidding.itemimage", "fields": {"item": 72, "image": "items/palm_tung.jpg"}}, {"pk": 76, "model": "bidding.itemimage", "fields": {"item": 73, "image": "items/41ibBc9x-2L._SS400_.jpg"}}, {"pk": 77, "model": "bidding.itemimage", "fields": {"item": 74, "image": "items/AcerBook.jpg"}}, {"pk": 78, "model": "bidding.itemimage", "fields": {"item": 75, "image": "items/aldo.jpg"}}, {"pk": 79, "model": "bidding.itemimage", "fields": {"item": 76, "image": "items/Macbook13.3.jpg"}}, {"pk": 80, "model": "bidding.itemimage", "fields": {"item": 77, "image": "items/shuffleblack.jpg"}}, {"pk": 81, "model": "bidding.itemimage", "fields": {"item": 78, "image": "items/shufflegrey.jpg"}}, {"pk": 82, "model": "bidding.itemimage", "fields": {"item": 79, "image": "items/Apple_iPod_touch_16_GB_2nd_Generation.jpg"}}, {"pk": 83, "model": "bidding.itemimage", "fields": {"item": 80, "image": "items/Apple_iPod_touch_16_GB_2nd_Generation2.jpg"}}, {"pk": 84, "model": "bidding.itemimage", "fields": {"item": 81, "image": "items/axion.jpg"}}, {"pk": 85, "model": "bidding.itemimage", "fields": {"item": 82, "image": "items/bakugan.jpg"}}, {"pk": 86, "model": "bidding.itemimage", "fields": {"item": 83, "image": "items/rolex.jpg"}}, {"pk": 88, "model": "bidding.itemimage", "fields": {"item": 84, "image": "items/Prada-handbag.png"}}, {"pk": 90, "model": "bidding.itemimage", "fields": {"item": 86, "image": "items/51W7xhE0hzL__SS400_.jpg"}}, {"pk": 91, "model": "bidding.itemimage", "fields": {"item": 87, "image": "items/1354123-4-2x.jpg"}}, {"pk": 92, "model": "bidding.itemimage", "fields": {"item": 87, "image": "items/1354123-5-2x.jpg"}}, {"pk": 93, "model": "bidding.itemimage", "fields": {"item": 87, "image": "items/1354123-p-MULTIVIEW.jpg"}}, {"pk": 6, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "About US", "url": "/aboutus/", "template_name": "", "sites": [1], "content": " <div class=\"faq_div\">\r\n        <div class=\"gray_header_left\"></div>\r\n        <div class=\"gray_header_right\"></div>\r\n        <div class=\"gray_header no_margin_ie6\">About Us</div>\r\n<div class=\"white_window_bg\">\r\n\r\n<h2>Welcome to Yambid.com where you can \"Shop with a penny\".</h2>\r\n \r\n<p>Yambid.com was created by the people, for the people!</p>\r\n \r\n<p>Bid on the best brands and latest electronics, computer hardware and luxury goods one penny at a time.</p>\r\n \r\n<p>Why pay more when you can win for pennies on the dollar?</p>\r\n \r\n\r\n<p>Yambid.com<br/>\r\n 3700 S. Las Vegas Blvd #STE 1176<br/>\r\n Las Vegas, NV 89109<br/>\r\n U.S.A.<br/>\r\n (949) 467-9751 </p>\r\n</div>\r\n<div class=\"white_left_corner\"><!-- --></div>\r\n<div class=\"white_right_corner\"><!-- --></div>\r\n<div class=\"white_bar no_margin_ie6\"><!-- --></div>\r\n<div class=\"ten_height_spacer\"></div>\r\n</div>\r\n\r\n\r\n", "enable_comments": false}}, {"pk": 9, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Chat Regulations", "url": "/chatregulation/", "template_name": "", "sites": [1], "content": "<div class=\"faq_div\">\r\n    <div class=\"gray_header_left\"></div>\r\n    <div class=\"gray_header_right\"></div>\r\n    <div class=\"gray_header no_margin_ie6\">Please follow this simple rules</div>\r\n    <div class=\"white_window_bg\">\r\n        <div class=\"ten_height_spacer\"><!-- --></div>\r\n        <p>\r\n           1. No Foul language please.<br/>\r\n           2. No discussions of member investments.<br/>\r\n           3. No promoting other sites.<br/>\r\n           4. Rude behavior will <b class=\"red_text\">NOT BE PERMITTED.<br/></b> \r\n           5. And the most important rule of all. <b class=\"green_text\">HAVE FUN!</b> \r\n<br/>\r\n         \r\n        </p>\r\n    </div>\r\n    <div class=\"white_left_corner\"><!-- --></div>\r\n    <div class=\"white_right_corner\"><!-- --></div>\r\n    <div class=\"white_bar no_margin_ie6\"><!-- --></div>\r\n    <div class=\"ten_height_spacer\"><!-- --></div>\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n\r\n", "enable_comments": false}}, {"pk": 4, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Contact US", "url": "/contactus/", "template_name": "", "sites": [1], "content": " <div class=\"faq_div\">\r\n        <div class=\"gray_header_left\"></div>\r\n        <div class=\"gray_header_right\"></div>\r\n        <div class=\"gray_header no_margin_ie6\">About Us</div>\r\n<div class=\"white_window_bg\">\r\n<p>When emailing please include <strong>bidding name</strong> in all correspondence. Thank you.</p>\r\n\r\n<a href=\"mailto:info@ibiddjango.com?subject=Yambid user\"\r\nstyle=\"color:#2A94D1;\">info@ibiddjango.com</a>\r\n \r\n<p>Yambid.com<br/>\r\n 3700 S. Las Vegas Blvd #STE 1176<br/>\r\n Las Vegas, NV 89109<br/>\r\n U.S.A.</p>\r\n (949) 467-9751 </p>\r\n</div>\r\n<div class=\"white_left_corner\"><!-- --></div>\r\n<div class=\"white_right_corner\"><!-- --></div>\r\n<div class=\"white_bar no_margin_ie6\"><!-- --></div>\r\n<div class=\"ten_height_spacer\"></div>\r\n</div>\r\n\r\n", "enable_comments": false}}, {"pk": 1, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "FAQ's", "url": "/faq/", "template_name": "", "sites": [1], "content": "    <div class=\"faq_div\">\r\n        <div class=\"gray_header_left\"></div>\r\n        <div class=\"gray_header_right\"></div>\r\n        <div class=\"gray_header no_margin_ie6\">Frequently asked Questions (FAQ)</div>\r\n\r\n\r\n\r\n        <div class=\"white_window_bg\">\r\n        <h2>How is Yambid different from other auction websites?</h2>\r\n        <p>Unlike other auction websites, Yambid.com allows you to win top of the line products for a fraction of their retail price.  We also have an interactive chat feature that will make bidding ten times more exciting than other sites. </p>\r\n        <h2>How does Yambid make money?</h2>\r\n        <p>We make our revenue strictly from the amount of bids we sell.  Remember, bids are needed in order for you to win an item.</p>\r\n        <h2>Who is considered a chat host?</h2>\r\n        <p>A chat host is anyone with <span style=\"color:#2A94D1;\">Auctioneer</span> screen name. You can always privately message the host for any questions you may have.</p>\r\n        <h2>How many accounts can I have?</h2>\r\n        <p>You may have up to 3 accounts per household. Need more? You may send us an email requesting for more.</p>\r\n        <h2>What is considered fraud?</h2>\r\n        <p>Fraud will be having more accounts than the ones allowed. ALL of your accounts will be deleted and you will be banned from the site. You will also forfeit any auction winnings and remaining bids.</p>\r\n        <h2>What does auction timer mean?</h2>\r\n        <p>The auction timer is the clock that resets every time a new bid is placed on an item. Remember, the auction time for each item is predetermined by the auctioneer. As the competition on an item increases, the predetermined time for that item is decreased to give you a better chance of winning.</p>\r\n        <h2>How long does the auction last?</h2>\r\n        <p>The auction duration is strictly determined by the bidders (YOU). The goal is to be the last bidder when the timer hits zero.</p>\r\n        <h2>How much does it cost to bid?</h2>\r\n        <p>Yambid.com charges an admission fee of UP TO $1 per bid. You can purchase Bid packages to qualify for FREE bids.</p>\r\n        <h2>How can I get free bids?</h2>\r\n        <p>You can get free bids by initially registering, inviting friends, sending video testimonials of your winnings to us, and by buying bid packages with bonus bids.  \r\n        <h2>How many auctions can I bid on?</h2>\r\n        <p>You may participate in all auctions simultaneously.</p>\r\n        <h2>What's the maximum I can bid?</h2>\r\n        <p>You can bid as many times as you want but can only increase the bid by One cent.</p>\r\n        <h2>How does auction price of an item increase?</h2>\r\n        <p>The price increases in increments of a penny every time a bid is placed.</p>\r\n        <h2>Can I withdraw my bids?</h2>\r\n        <p>No. Once a bid is placed it is final.</p>\r\n        <h2>Can I cash out my bids?</h2>\r\n        <p>No. All bids purchased are non-transferable and non-refundable and may only be used by bidding on the Yambid marketplace.<br/>\r\n\r\n        The winning bidder pays the final auction closing price.</p>\r\n        <h2>How much is shipping?</h2>\r\n        <p>Your shipping is free! Yambid.com will be handling your shipping charges.</p>\r\n        <h2>How do I get my product?</h2>\r\n        <img width=\"253\" height=\"48\" src=\"/static/images/amazon.gif\" alt=\"Your product is shipped directly from Amazon.com\"/>\r\n        <p>Your product is shipped directly from Amazon.com</p>\r\n        <h2>How fast do you ship?</h2>\r\n        <p>We ship within 5-7 business days from the time the payment is completed.</p>\r\n        <h2>How do you ship?</h2>\r\n        <img width=\"300\" height=\"75\" src=\"/static/images/fedex.gif\" alt=\"Fedex, UPS\"/>\r\n        <h2>Do you ship internationally?</h2>\r\n        <p>At this time we only ship to the US. Some restrictions may apply for Alaska and Hawaii based on the size of the item shipped. Check again as we will be adding other countries soon.</p>\r\n        <h2>What payment methods do you accept?</h2>\r\n        <img width=\"300\" height=\"57\" src=\"/static/images/visa_mc.gif\" alt=\"Visa, MC, Amex, Paypal\"/>\r\n        <h2>How long do I have to pay for the auction?</h2>\r\n        <p>You have 72 hours to complete payment from the time the auction is closed. If payment is not received, Yambid reserves the right to list the item without prior notice.</p>\r\n        <h2>What kind of warranty comes with the products purchased?</h2>\r\n        <p>Most items come with a standard manufacturer warranty. Please log-on the manufacturer's site directly for any warranty related questions on your items.</p>\r\n        <h2>What is your return policy?</h2>\r\n\r\n        <p>All sales are FINAL. Yambid will gladly exchange any defective item if a claim is made within 7 days from the time the item is received.</p>\r\n        <h2>Can I cancel my purchase?</h2>\r\n        <p>When winning an item, you have agreed to purchase it.  No cancellations.</p>\r\n        <h2>How can you be reached?</h2>\r\n        <p>You can reach us via email:<br/>\r\n        (info@ibiddjango.com)</p>\r\n        <h2>Must I submit my picture if I win?</h2>\r\n        <p>ibiddjango reserves the right to contact and publish the winner's information on its website. On items valued at or over $1,000 US the auction winner must agree to a photo/video interview to be displayed on Yambid.com site and other marketing resources.</p>\r\n        <div class=\"ten_height_spacer\"><!-- --></div>\r\n        <p>The purpose of Yambid.com is to provide entertainment and great bargains.</br> \r\nYambid.com holds the right to refuse service/bidding rights to anyone.</p>\r\n        </div>\r\n        <div class=\"white_left_corner\"><!-- --></div>\r\n        <div class=\"white_right_corner\"><!-- --></div>\r\n        <div class=\"white_bar no_margin_ie6\"><!-- --></div>\r\n        <div class=\"ten_height_spacer\"><!-- --></div>\r\n    </div>\r\n", "enable_comments": false}}, {"pk": 8, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "How it works?", "url": "/howto/", "template_name": "", "sites": [1], "content": "<div class=\"faq_div\">\r\n\t\t\t\t\t\t\t<div class=\"gray_header_left\"></div>\r\n\t\t\t\t\t\t\t<div class=\"gray_header_right\"></div>\r\n\t\t\t\t\t\t\t<div class=\"gray_header no_margin_ie6\">Video Tutorial</div>\r\n\t\t\t\t\t\t\t<div class=\"white_window_bg\">\r\n\t\t\t\t\t\t\t\t<div class=\"ten_height_spacer\"><!-- --></div>\r\n\t\t\t\t\t\t\t\t<div class=\"flash_embed testimonials_embed_flash\">\r\n\t\t\t\t\t\t\t\t\t<object width=\"500\" height=\"405\"><param name=\"movie\" value=\"http://www.youtube.com/v/IcrzuHl_VfY&hl=en&fs=1&border=1\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://www.youtube.com/v/IcrzuHl_VfY&hl=en&fs=1&border=1\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"500\" height=\"405\"></embed></object>\r\n\t\t\t\t\t\t\t\t</div>\r\n\t\t\t\t\t\t\t\t<div class=\"ten_height_spacer\"><!-- --></div>\r\n\t\t\t\t\t\t\t</div>\r\n\t\t\t\t\t\t\t<div class=\"white_left_corner\"><!-- --></div>\r\n\t\t\t\t\t\t\t<div class=\"white_right_corner\"><!-- --></div>\r\n\t\t\t\t\t\t\t<div class=\"white_bar no_margin_ie6\"><!-- --></div>\r\n\t\t\t\t\t\t\t<div class=\"ten_height_spacer\"><!-- --></div>\r\n\t\t\t\t\t\t\t<div class=\"gray_header_left\"></div>\r\n\t\t\t\t\t\t\t<div class=\"gray_header_right\"></div>\r\n\t\t\t\t\t\t\t<div class=\"gray_header no_margin_ie6\">Schema of the Auction</div>\r\n\t\t\t\t\t\t\t<div class=\"white_window_bg\">\r\n\t\t\t\t\t\t\t\t<div class=\"ten_height_spacer\"><!-- --></div>\r\n\t\t\t\t\t\t\t\t<div class=\"tutorial_image\"></div>\r\n\t\t\t\t\t\t\t\t<div class=\"ten_height_spacer\"><!-- --></div>\r\n\t\t\t\t\t\t\t</div>\r\n\t\t\t\t\t\t\t<div class=\"white_left_corner\"><!-- --></div>\r\n\t\t\t\t\t\t\t<div class=\"white_right_corner\"><!-- --></div>\r\n\t\t\t\t\t\t\t<div class=\"white_bar no_margin_ie6\"><!-- --></div>\r\n\t\t\t\t\t\t\t<div class=\"ten_height_spacer\"><!-- --></div>\r\n\t\t\t\t\t\t\t<div class=\"gray_header_left\"></div>\r\n\t\t\t\t\t\t\t<div class=\"gray_header_right\"></div>\r\n\t\t\t\t\t\t\t<div class=\"gray_header no_margin_ie6\">Here is How it Works</div>\r\n\t\t\t\t\t\t\t<div class=\"white_window_bg\">\r\n\t\t\t\t\t\t\t\t<div class=\"ten_height_spacer\"><!-- --></div>\r\n\t\t\t\t\t\t\t\t<p>\r\n\t\t\t\t\t\t\t\t\t1. First, you register.<br/>\r\n\t\t\t\t\t\t\t\t\t2. After registering, you confirm your email and acquire your 5 free bids.<br/>\r\n\t\t\t\t\t\t\t\t\t3. Now you may begin bidding.<br/>\r\n\t\t\t\t\t\t\t\t\t4. To win, you must place the last bid.\r\n\t\t\t\t\t\t\t\t</p>\r\n      \r\n\r\n  <p>\r\n        The auction starts after the first bid is placed on an item.\r\n\tEach time a new bid is placed, the resets to a predetermined time.\r\n        When the timer hits zero and you are the last bidder, you win!\r\n   </p> \r\n \r\n\t<h2>The purpose of Yambid.com is to provide entertainment and great bargains. Yambid.com holds the right to refuse service/bidding rights to anyone. The following are regulations that need to be followed in order to maintain an enjoyable and inviting online bidding experience for everyone. </h2>\r\n\t\t\t\t\t\t\t</div>\r\n\t\t\t\t\t\t\t<div class=\"white_left_corner\"><!-- --></div>\r\n\t\t\t\t\t\t\t<div class=\"white_right_corner\"><!-- --></div>\r\n\t\t\t\t\t\t\t<div class=\"white_bar no_margin_ie6\"><!-- --></div>\r\n\t\t\t\t\t\t\t<div class=\"ten_height_spacer\"><!-- --></div>\r\n    <div class=\"gray_header_left\"></div>\r\n    <div class=\"gray_header_right\"></div>\r\n    <div class=\"gray_header no_margin_ie6\">Chat Regulations</div>\r\n    <div class=\"white_window_bg\">\r\n        <div class=\"ten_height_spacer\"><!-- --></div>\r\n        <p>\r\n           1. No Foul language please.<br/>\r\n           2. No discussions of member investments.<br/>\r\n           3. No promoting other sites.<br/>\r\n           4. Rude behavior will <b class=\"red_text\">NOT BE PERMITTED.</b><br/>\r\n           5. And the most important rule of all. <b class=\"green_text\">HAVE FUN!</b> \r\n</p>\r\n    </div>\r\n    <div class=\"white_left_corner\"><!-- --></div>\r\n    <div class=\"white_right_corner\"><!-- --></div>\r\n    <div class=\"white_bar no_margin_ie6\"><!-- --></div>\r\n    <div class=\"ten_height_spacer\"><!-- --></div>\r\n</div>", "enable_comments": false}}, {"pk": 7, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Invite a Friend and Get Free Bids!", "url": "/invitefriend/", "template_name": "", "sites": [1], "content": "<div class=\"registration_form text_align_center \">\r\n<h2 style=\"color:black;\">Coming soon...</h2>\r\n</div>", "enable_comments": false}}, {"pk": 5, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Privacy Policy", "url": "/privacy/", "template_name": "", "sites": [1], "content": "<div class=\"faq_div\">\r\n<div class=\"gray_header_left\"></div>\r\n<div class=\"gray_header_right\"></div>\r\n<div class=\"gray_header no_margin_ie6\">Terms And Conditions</div>\r\n<div class=\"white_window_bg\">\r\n<p>Yambid.com respects the privacy of its customers, and other individuals and businesses using Yambid.com Site. This Privacy Policy, effective October 1st, 2008, is to keep you informed about the types of information collected on Yambid Sites and how the information is used and protected.</p>\r\n<h2>USE OF COOKIES</h2>\r\n<p>Yambid Sites may use \"cookies\" to collect anonymous information. Cookies are bits of encrypted data that are loaded by Yambid's server onto your computer when you visit an Yambid Site. The server can retrieve the cookies the next time you visit a site and use them to identify the computer as a return visitor. Yambid.com uses cookies to collect non-personally identifiable information and generically track usage patterns on the Yambid Sites in order to monitor activity and administer the sites. Yambid.com also uses information obtained from cookies to improve Yambid Sites, and make decisions concerning advertising, product offerings and services. Most users can disable cookies from their Internet browsers, receive a warning before a cookie is placed on their computer, and erase all cookies from their computer hard drives by following the instructions provided by the browser.</p>\r\n <h2>ADVERTISEMENTS ON Yambid SITES</h2>\r\n<p>Advertising companies deliver ads on some Yambid Sites. You should be aware that when you click on these ads, the advertising companies may also deploy cookies to receive anonymous information about ad viewing by Internet users on Yambid Sites and other Web sites. This information is associated with your Web browser, but cannot be associated with your name or e-mail address without your permission. Therefore, advertising companies may know where your computer goes on the Web, but they do not know who you are unless you tell them. Yambid.com does not provide personally identifiable information about its customers or Yambid Site visitors to these advertising companies.</p>\r\n <h2>PERSONALLY IDENTIFIABLE INFORMATION</h2>\r\n<p>Yambid.com may ask you to provide what is often referred to as \"personally identifiable information\" such as your name, address, telephone number and e-mail address when you use Yambid Sites to bid on products. Personally identifiable information provided at an Yambid Site to order Yambid.com products will be protected in the same manner as when the information is provided by other means such as over the telephone or by mail. We use personally identifiable information provided at an Yambid Site in the following ways unless otherwise specified: For its intended purpose (such as to complete an online order for products), To provide you with information about new Yambid products or products offered in conjunction with Yambid.com business partners and affiliates.</p>\r\n<h2> DISCLOSURE TO THIRD PARTIES</h2>\r\n\r\n<p>We will make your personally identifiable information available to other companies or people when: You have elected to allow us to share that information at the time that you registered with us or provided us the information through our website. We hire third-party vendors to provide specialized services such as customer support; email message deployment; suppression, merge and de-duplication services; data processing; and special products or services that you have requested. These companies are only allowed to use the information in order to help us fulfill our services to you. We do not provide your information to these companies for their own, permanent use. You unsubscribe for a mailing that we send to you on behalf of a third party. We may share your removal instruction with the third party so that it may be added to that person’s list of people to whom they may not send emails. When required by law, such as when we respond to subpoenas court orders, or legal process. We believe that your actions violate applicable laws, Yambid Terms of Use, or any usage guidelines for specific products or services, or threaten the rights, property, or safety of our company, our users, or others. In the event it is required in connection with the sale, lease or transfer of all or a portion of Yambid.com' assets.</p>\r\n <h2>E-MAIL COMMUNICATIONS</h2>\r\n<p>Yambid.com may use e-mail to communicate with you, respond to your e-mail, and to tell you about new products and services. If you do not wish to receive e-mail promotions and new products and service announcements from Yambid.com, please follow the instructions that appear at the end of the e-mail communication that you receive from Yambid.com to have your name removed from the list.</p>\r\n <h2>SECURITY</h2>\r\n<p>Yambid.com utilizes several encryption methods to ensure that the data you submit on any of the Yambid Sites is secure. Through this \"secure session,\" information that you input into a Yambid.com online order form will be sent and will arrive privately and unaltered at an Yambid server. This security prohibits access to your information by other companies and Web users.</p>\r\n <h2>CHILDREN</h2>\r\n<p>Yambid.com does not intend to collect personally identifiable information from individuals under 18 years of age. If Yambid.com becomes aware that a user who is under 18 is using an Yambid Site, Yambid.com will specifically instruct that individual that they are not to submit information on Yambid Sites without a parent or guardian's consent. If a child has provided Yambid.com with personally identifiable information without Yambid.com' knowledge, a parent or guardian of the child may contact Yambid.com at info@Yambid.com and Yambid.com will delete the child's information from our existing files.</p>\r\n <h2>LINKS</h2>\r\n<p>Some Yambid Sites contain links to other Web sites that are owned and operated by parties other than Yambid.com. Please be aware that this Privacy Policy does not extend to any Web sites other than those owned and controlled by Yambid.com.</p>\r\n <h2>ACCOUNT INFORMATION</h2>\r\n<p>You may always contact us at info@Yambid.com or by telephone or mail to verify your name, address, e-mail address, telephone number and/or billing information. Yambid.com will correct any information that is inaccurate.</p>\r\n <h2>QUESTIONS</h2>\r\n<p>If you have questions or comments regarding this Privacy Policy, you may contact us at info@Yambid.com. If you have submitted personally identifiable information, and would like that information deleted from our records, please contact us at our e-mail address, info@Yambid.com. We will use reasonable efforts to delete that information from our files.</p>\r\n <h2>UPDATES</h2>\r\n<p>Yambid.com may amend this Privacy Policy from time-to-time. These changes will be posted online.</p>\r\n\r\n\r\n<div class=\"ten_height_spacer\"><!-- --></div>\r\n</div>\r\n<div class=\"white_right_corner\"><!-- --></div>\r\n<div class=\"white_left_corner\"><!-- --></div>\r\n<div class=\"white_bar no_margin_ie6\"><!-- --></div>\r\n</div>\r\n\r\n", "enable_comments": false}}, {"pk": 3, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Terms And Conditions", "url": "/terms/", "template_name": "", "sites": [1], "content": "<div class=\"faq_div\">\r\n<div class=\"gray_header_left\"></div>\r\n<div class=\"gray_header_right\"></div>\r\n<div class=\"gray_header no_margin_ie6\">Terms And Conditions</div>\r\n<div class=\"white_window_bg\">\r\n<h2>1. Overview</h2>\r\n<p>\r\nThe following General Terms and Conditions shall apply exclusively to the business relationship between Yambid, LLC., its internet platform www.ibiddjango.com (\"Yambid\") and our users. By using Yambid, the user accepts the following Terms and Conditions, as well as the manner in which Yambid and the “Auctioneers” operate as described on the website www.ibiddjango.com. Variations or alterations in the following Terms and Conditions shall only be binding upon Yambid, LLC if agreed to in writing.\r\n\r\n</p> \r\n<p>        \r\nAny special promotions run by Yambid shall only be valid if they are announced on Yambid’s website. Any bidding advice or other written materials (for instance, ‘how it works’ Press Releases) posted on Yambid are provided solely as suggestions and are not intended to be relied upon. Yambid is not liable or responsible for any actions taken due to a user or other person having read or been told about such advice or other written materials.\r\n\r\n</p> \r\n\r\n<h2>2. Eligibility to Participate/Registration with “Yambid”/Disqualification</h2>\r\n<p>\r\nBy placing a bid on Yambid, the user declares that they are legally capable of entering into binding contracts and that they are at least 18 years old.\r\n\r\n</p>\r\n<p>\r\nEmployees and relatives of employees of Yambid, LL Care not eligible to participate in Yambid auctions under any circumstances.\r\n\r\n</p>\r\n<p>\r\nYambid’s products and services are offered exclusively to private users and not to commercial or partly-commercial resellers. Yambid reserves the right to exclude commercial resellers from the participation in the auctions and to close their user accounts at any time. Each user may register only once using their postal address (registration using PO Boxes or equivalents is not permitted). Additionally, up to three users registration per household is permitted. During the registration process, the user must choose a username. The username must not be offensive, be selected to deceive or mis-inform other users, may not offend common decency or infringe upon the rights of third parties. If Yambid receives information of a username which is illegal or in breach of these Terms, this username can be amended by Yambid without prior notice. The corresponding user password is to be kept secret by the user. User accounts created during registration are non-transferable. The user account may be used only by the user and not by anyone else. Any abuse of the user account, be it to the detriment of third parties or to the detriment of Yambid, shall result in the disqualification of the user and the reporting of a crime. In general, the user shall be liable for all activities that are undertaken using the user account together with the associated password.\r\n\r\n</P>\r\n<p>\r\nYambid reserves the right to temporarily or permanently disqualify a user, or disable their account at any time, and at its sole discretion. Users will be disqualified when in the reasonable opinion of Yambids’ member has violated any laws or the rights of third parties. A user will be disqualified if such action will protect the rights of other users, or to prevent unauthorized manipulation or use of Yambid. Examples of such unauthorized usage include (but are not limited to) non-payment of bids, use of unauthorized third-party bidding software or set up of multiple user accounts by the same individual. In case of a breach of these Terms, Yambid reserves the right to withhold deliveries or refunds for bids.\r\n\r\n</p> \r\n<p>\r\nFurthermore, Yambid reserves the right to limit the number of auctions a user may win or the number of his successfully finished auctions at its sole discretion. Please refer to our separate acceptable use policy for additional information.\r\n\r\n</P> \r\n\r\n<h2>3. Bid Purchasing for Online Bidding/Payment/Validity of Bids</h2>\r\n<p>\r\nBidding rights, so-called “bids”, must be purchased and paid for by users prior to online bidding. Bids can be purchased in packages (so-called “BidPacks”) at the currently applicable prices, which can be viewed under “How to Video” or in the “Buy Bids” link.\r\n\r\n</p> \r\n<p>\r\nPayments can be made by credit/debit card or via payment agents such as PayPal. Should a payment not be honored by a user, a returned payment fee will be charged. The user will be responsible for these fees. Yambid reserves the right to block access to the user’s account until payment in full of the invoice amount, including any fees due to returned payment etc., and to withhold any outstanding deliveries until payment is received in full.\r\n\r\n</p>\r\n <p>\r\nPurchase bids or free bids have expiration date, but once a Bid is placed in an auction, it is deducted from the user’s bid account and can no longer be refunded. Refunds will not be issued for Bids placed in an auction. For further information on refunds please see our <b>Refund Policy</b>.\r\n\r\n</p> \r\n\r\n<h2>4. Bidding</h2>\r\n<p>\r\nBids can be placed by clicking on the relevant bid buttons.  The Auctioneer is a Yambid team member who assists bidders if they have any questions. To ask an Auctioneer a question about bidding, you must communicate through our built in chat feature.  The user can read about how the Auctioneer operates in the “How It Works” section. The user is prohibited from using bidding software not authorized by Yambid, and doing so will result in immediate disqualification from use (see clause 2: Eligibility and the Acceptable Use Policy). \r\n\r\n</p>\r\n\r\n<h2>5. How the Auctions Work</h2>\r\n<p>\r\nWith each bid placed, the price of the item on which the user is bidding increases by the amount specified (one penny). A bid submitted by the user constitutes willingness of a user to enter into a binding contract with Yambid and in the event of a successful finishing of an auction, the claim to receive a purchase offer for the item of the auction under the conditions set out in the related auction. A contract to purchase the item does not come into effect until the auction is finished and the last bidder has followed all the steps as set forth in clause number 6.\r\n\r\n</p>\r\n<p>\r\nEach new bid resets the ‘remaining time’ for an auction up to, but not above, the displayed countdown reset value (usually 3, 5, 10, 15, 30, 60, 120 seconds).  For more information, please consult the ‘Auctioneer’ working at that time. The auction ends when the remaining time reaches zero. The user who was the last to bid then wins the auction. All other bids placed on the item expire and will not be credited back to the user’s account or be eligible for a refund. The last bidder is determined based on the records in Yambid’s database and Yambid’s decision regarding who is the last bidder shall be final (save in the case of manifest error).\r\n\r\n</p> \r\n\r\n<h2>6. Acceptance of the Win / Payment</h2>\r\n<p>\r\nAfter an auction has ended, the last bidder (“winner”) will get a link to fill in his/her information for the delivery process. Here, information such as total price and payment options will be displayed. The user must actively confirm and pay the total price (end price only shipping is free) for the win by following the steps indicated on that page or elsewhere on the website. Once the winner has clicked on the confirmation button the win is accepted. If an auction win has not been confirmed and paid within 21 days of the auction end date, Yambid reserves the right to withdraw the offer to conclude a contract and the winner’s right to pay for and receive delivery of an item will be permanently revoked. All bids placed in that auction expire and are non-refundable. The user must pay the total price when confirming the win. After confirming the win and paying the amount due, the winner will receive a confirmation e-mail.\r\n\r\n</p>\r\n<p>\r\nThe item will not be sent to the user until the total price has been paid to Yambid. A similar requirement for delivery is that all bids purchased and used by the user have been properly paid for. Should bids that have already been purchased and used not have been paid for, payments received shall be viewed as payment toward the bids not yet paid for, and we reserve the right to retain the item purchased at auction until all bids and the total price have been paid for in full. Yambid reserves the right to charge the winner reasonable storage charges for items not paid for.\r\nAn invoice containing the auction price and shipping costs will be sent to the user by Yambid once delivery has been arranged. \r\n\r\n</p>\r\n\r\n<h2>7. Returns and Cancellations</h2>\r\n<p>\r\nYambid grants winners the right to cancel an order. This right is unconditional and begins from the moment the contract is concluded. If a user cancels a contract to which the cancellation provisions apply they are entitled to a refund of the auction end price they have paid in relation to the contract even if the goods are not defective in any way. Bids placed on the auction are not eligible for a refund. These cancellation rights end fourteen days after the day on which a winner received the goods or a notification that the goods are ready for collection. \r\nAn exception to the right to cancel is audio or video recordings or computer software that the customer has unsealed. These items are not eligible for return or refund.\r\n\r\n</p>\r\n<p>\r\nIf a user wishes to cancel the contract, they must inform Yambid in writing (by letter or email), that they want to cancel within the time period noted above. Cancellations by phone will not be accepted.\r\n\r\n</p>\r\n<fieldset><legend>\r\nThe following contact details must be used:\r\n</legend>\r\n<p>\r\n    Yambid, LLC.<br/>\r\n    3700 S. Las Vegas Blvd #STE 1176<br/>\r\n    Las Vegas, NV 89109<br/>\r\n    U.S.A.<br/>\r\n<a style=\"color: rgb(42, 148, 209);\" href=\"mailto:info@ibiddjango.com?subject=Yambid user\">info@ibiddjango.com</a>\r\n</p></fieldset>\r\n<p>\r\nIn order to complete a valid cancellation or return, a user must return the received product or products in good condition, such as might be expected from typical testing in a retail store. Costs of postage for returns will be paid by the user (unless goods are found to be faulty). If the user is unable to return the service or product received or only able to return it in part or only in a depreciated condition, he will have to pay compensation to us [the amount refundable will be reduced proportionally], as applicable. \r\n</p>\r\n<p>\r\nShould Yambid incur additional costs for insufficient postage on the return or for courier shipments and other irregular shipping methods that are over and above postal shipping costs, these costs will be deducted from any payment whatsoever remitted by the customer. Sets/boxes can only be returned in their entirety. \r\n\r\n</p>\r\n\r\n<h2>8. Delivery</h2>\r\n<p>\r\nUnless otherwise stated, delivery will be made directly from our suppliers or from our warehouse to the address provided by the user. Deliveries are made solely within the 50 states of the United States (explicitly excluding the U.S. sovereign territories of Guam, Puerto Rico and the U.S. Virgin Islands). Some restrictions or higher shipping costs may apply if the delivery address is in Alaska or Hawaii, please check notifications on the detail pages of the auctions in advance. \r\n\r\n</p>\r\n<p>\r\nDelivery times vary and any delivery time indicated is provided only as a guide and is not guaranteed. Yambid shall be entitled to involve third parties to satisfy its contractual obligations without being required to notify the buyer. Obvious damage to the item from transport or packaging damaged during transport is to be reported to Yambid upon taking delivery.\r\n\r\n</p>\r\n<p>\r\nShould Yambid not be able to deliver the item ordered, Yambid shall be entitled to substitute the item with a comparable replacement product with the same or better features, or provide a refund of the auction end price to the user based upon the user’s preference. \r\n\r\n</p>\r\n\r\n<h2>9. Offsetting / Withholding Payment / Retention of Title</h2>\r\n<p>\r\nThe user shall only have the right to offset if his or her counterclaims are not disputed by Yambid. The user is not entitled by reason of any alleged minor defect to withhold more than a proportionate amount of the sum due.\r\n\r\n</p> \r\n<p>\r\nThe item delivered shall remain Yambid’s property until payment is received in full of the total price, including for the bids used in the auction. Until such time as payment has been made in full the user undertakes to store the item separately from their other possessions and to insure it. \r\n\r\n</p>\r\n<p>\r\n<h2>10. Disclaimer of Warranty and Limitation of Liability regarding the Use of Yambid.\r\n</h2>\r\n</p>\r\n\r\n<p>\r\nUSER EXPRESSLY AGREES THAT USE OF YAMBID INTERACTIVE IS AT USER'S SOLE RISK. NEITHER YAMBID, ITS AFFILIATES NOR ANY OF THEIR RESPECTIVE EMPLOYEES, AGENTS, THIRD PARTY CONTENT PROVIDERS OR LICENSORS WARRANT THAT YAMBID WILL BE UNINTERRUPTED OR ERROR FREE; NOR DO THEY MAKE ANY WARRANTY AS TO THE RESULTS THAT MAY BE OBTAINED FROM USE OF YAMBID, OR AS TO THE ACCURACY, RELIABILITY OR CONTENT OF ANY INFORMATION, SERVICE, OR MERCHANDISE PROVIDED THROUGH YAMBID.\r\n\r\n</p>\r\n<p>\r\nYAMBID IS PROVIDED ON AN \"AS IS\" BASIS; TO THE MAXIMUM EXTENT PERMITTED BY LAW, YAMBID DISCLAIMS ALL REPRESENTATIONS AND WARRANTIES, EXPRESS OR IMPLIED, WITH RESPECT TO ANY INFORMATION, SERVICES, PRODUCTS AND MATERIALS, INCLUDING, BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE, TITLE, NON-INFRINGEMENT, FREEDOM FROM COMPUTER VIRUS AND IMPLIED WARRANTIES ARISING FROM COURSE OF DEALING OR COURSE OF PERFORMANCE. IN ADDITION, YAMBID DOES NOT REPRESENT OR WARRANT THAT THE INFORMATION ACCESSIBLE VIA THE SITE IS ACCURATE, COMPLETE OR CURRENT. WE ARE NOT RESPONSIBLE FOR TYPOGRAPHICAL ERRORS.\r\n\r\n</p>\r\n<p> \r\nTHIS DISCLAIMER OF LIABILITY APPLIES TO ANY DAMAGES OR INJURY CAUSED BY ANY FAILURE OF PERFORMANCE, ERROR, OMISSION, INTERRUPTION, DELETION, DEFECT, DELAY IN OPERATION OR TRANSMISSION, COMPUTER VIRUS, COMMUNICATION LINE FAILURE, THEFT OR DESTRUCTION OR UNAUTHORIZED ACCESS TO, ALTERATION OF, OR USE OF RECORD, WHETHER FOR BREACH OF CONTRACT, TORTIOUS BEHAVIOR, NEGLIGENCE, OR UNDER ANY OTHER CAUSE OF ACTION. USER SPECIFICALLY ACKNOWLEDGES THAT YAMBID IS NOT LIABLE FOR THE DEFAMATORY, OFFENSIVE OR ILLEGAL CONDUCT OF OTHER USERS OR THIRD-PARTIES AND THAT THE RISK OF INJURY FROM THE FOREGOING RESTS ENTIRELY WITH USER.\r\n\r\n</p>\r\n<p>\r\nIN NO EVENT WILL YAMBID, OR ANY PERSON OR ENTITY INVOLVED IN USE OF A YAMBID AUCTION, BE LIABLE FOR ANY DAMAGES, INCLUDING, WITHOUT LIMITATION, DIRECT, INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL OR PUNITIVE DAMAGES ARISING OUT OF THE USE OF OR INABILITY TO USE YAMBID. USER HEREBY ACKNOWLEDGES THAT THE PROVISIONS OF THIS SECTION SHALL APPLY TO ALL CONTENT ON YAMBID.\r\n\r\n</p>\r\n<p>\r\nIN ADDITION TO THE TERMS SET FORTH ABOVE NEITHER, YAMBID, NOR ITS AFFILIATES, INFORMATION PROVIDERS OR CONTENT PARTNERS SHALL BE LIABLE REGARDLESS OF THE CAUSE OR DURATION, FOR ANY ERRORS, INACCURACIES, OMISSIONS, OR OTHER DEFECTS IN, OR UNTIMELINESS OR UNAUTHENTICITY OF, THE INFORMATION CONTAINED YAMBID, OR FOR ANY DELAY OR INTERRUPTION IN THE TRANSMISSION THEREOF TO THE USER, OR FOR ANY CLAIMS OR LOSSES ARISING THEREFROM OR OCCASIONED THEREBY. NONE OF THE FOREGOING PARTIES SHALL BE LIABLE FOR ANY THIRD-PARTY CLAIMS OR LOSSES OF ANY NATURE, INCLUDING, BUT NOT LIMITED TO, LOST PROFITS, PUNITIVE OR CONSEQUENTIAL DAMAGES. NEITHER, YAMBID, NOR ITS AFFILIATES, INFORMATION PROVIDERS OR CONTENT PARTNERS WARRANT OR GUARANTEE THE TIMELINESS, SEQUENCE, ACCURACY OR COMPLETENESS OF THIS INFORMATION. ADDITIONALLY, THERE ARE NO WARRANTIES AS TO THE RESULTS OBTAINED FROM THE USE OF THE INFORMATION.\r\n \r\n</p>\r\n\r\n<h2>11. Disclaimer of Warranty and Limitation of Liability regarding Purchases from Yambid.</h2>\r\n<p>\r\nAll new products are sold with the manufacturer's limited warranty only. Yambid warrants solely that the products sold to user under these terms shall have the characteristics specified in Yambid’s specifications for such Products as set forth in the description of each auction and assumes no further warranties. The warranty period and service varies by manufacturer and product. The full text of any such warranty is available, free of charge, upon written request mailed to Yambid. Warranty is excluded for the delivery of any used Products.\r\n\r\n</p>\r\n<p>\r\nEXCEPT FOR THE WARRANTIES SET FORTH ABOVE YAMBID MAKES NO OTHER WARRANTIES, EITHER EXPRESS OR IMPLIED, WITH RESPECT TO THE PRODUCTS, OR ANY RELATED SERVICES PERFORMED BY YAMBID OR ANY OF ITS AGENTS OR SUBCONTRACTORS IN CONNECTION WITH ANY ORDER, INCLUDING, WITHOUT LIMITATION, ANY WARRANTIES OF FITNESS FOR A PARTICULAR PURPOSE, WHICH OTHER WARRANTIES ARE EXPRESSLY EXCLUDED AND DISCLAIMED.\r\nYAMBID SHALL NOT BE LIABLE FOR PERSONAL INJURY AND PROPERTY DAMAGE RESULTING FROM THE IMPROPER HANDLING, MODIFICATION, MISUSE OF THE PRODUCTS BY THE CUSTOMER OR ANY OTHER PERSON FOLLOWING DELIVERY BY YAMBID. IN NO EVENT SHALL YAMBID BE LIABLE TO ANY PERSON FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES INCLUDING BUT NOT LIMITED TO LOSS OF PROFITS OR GOODWILL, LOSS-OF-USE DAMAGES OR ADDITIONAL EXPENSES INCURRED, WHETHER PURSUANT TO A CLAIM IN CONTRACT, TORT OR OTHERWISE AND WHETHER IN AN ACTION FOR BREACH OF WARRANTY OR OTHERWISE. \r\n\r\n</p>\r\n\r\n<h2>12. System Outage / Temporarily Halted Auctions</h2>\r\n<p>\r\nA system outage has occurred if no bids can be submitted for items due to an unforeseeable disruption in a system. In such a case, auctions will be temporarily halted and the remaining times for the auctions, the current bidding price and the current highest bidder will be maintained. After the disruption has been resolved, the auctions will be continued and 10 minutes will be added to the remaining times for the auctions. Temporarily halted auctions are clearly indicated. Bids placed on a temporarily halted auction shall not be credited back on a user’s account and are not eligible for a refund for bids used or other costs incurred.\r\n\r\n</p>\r\n<p>\r\nWith the currently available technology, it is not possible to develop and operate computer programs (software) and data processing systems (hardware) completely without errors, or to rule out any unpredictable events in connection with the internet (hereinafter referred to collectively as “technical faults”). Yambid, therefore, provides no guarantee for the constant and uninterrupted availability of its website and technical systems. In addition, but not subject to, the provisions of clause number 10, Yambid shall not be liable for any damage whatsoever incurred by auction users or third parties from using Yambid’s services. In particular, Yambid shall not be liable for damage that occurs due to bids submitted by auction users not being received by Yambid or not being received promptly or not being considered, as a consequence of technical faults. \r\n\r\n</p>\r\n\r\n<h2>13. Trademarks</h2>\r\n<p>\r\nYambid's logos are trademarks of Yambid, LLCand any of its subsidiaries. All rights reserved. All other trademarks appearing on Yambid are the property of their respective owners. \r\n\r\n</p>\r\n\r\n<h2>14. Service and Support for Products Purchased</h2>\r\n<p>\r\nAll requests for technical service and support should be made directly to the manufacturer in accordance with their terms and conditions. \r\n\r\n</p>\r\n\r\n<h2>15. Applicable Law / Severability Clause</h2>\r\n<p>\r\nThis Terms of Use Agreement and your use of the website shall be governed by the laws of the United States of America and the State of California without regard to its conflicts of laws principles. Any legal action or proceeding related to this website shall be brought exclusively in a federal or state court of competent jurisdiction sitting in California.\r\n\r\n</p>\r\n\r\n<h2>16. Protection of Data</h2>\r\n<p> \r\nCollection, Processing, and Use of our Customers’ Personal Information\r\nThe protection of your data is very important to us.\r\n \r\n</p>\r\n<p>\r\nFor more information on the collection, processing, and use of personal data, please read our Privacy Policy.\r\n\r\n</p>\r\n\r\n<h2>17. General</h2>\r\n<p>\r\nThe contract between Yambid and users is binding on the parties and on their respective successors and assigns. The user may not transfer, assign, charge or otherwise dispose of any contract formed under these General Terms and Conditions or any of their rights or obligations without Yambid’s prior written consent.\r\n\r\n</p>\r\n<p>\r\nYambid has the right to revise and amend these General Terms and Conditions from time to time in its absolute discretion but for reasons including but not limited to changes in market conditions affecting Yambid’s business, changes in technology, changes in payment methods, changes in relevant laws and regulatory requirements and changes in Yambid’s system capabilities. All users will be subject to the policies and terms and conditions in force at the time that they have successfully bid for items listed on the Yambid website, unless any change to such policies or terms and conditions is required to be made by law or governmental authority or Yambid notifies its users of the changes to such policies or General Terms and Conditions before Yambid sends information relating to dispatch (in which case Yambid has the right to assume that all successful winners have accepted the changes to the terms and conditions unless notified to the contrary with 7 working days by the user of the items).\r\n\r\n</p>\r\n<p>\r\nYambid is the owner or licensee of all intellectual property rights on the Yambid website and the material published on it. Those works are protected by copyright laws and treaties around the world and all rights relating to the same are reserved. Users may print one copy and may download extracts of pages for personal reference only. Users may not modify any paper or digital copies of any materials printed or downloaded. Users must also not use any illustrations, photographs, video or audio sequences or any graphics separately from any accompanying text. Users must not use any part of the materials on the Yambid website for commercial purposes.\r\n\r\n</p>\r\n<p>\r\nThis Agreement and any operating rules for Yambid established by Yambid constitute the entire agreement of the parties with respect to the subject matter hereof, and supersede all previous written or oral agreements between the parties with respect to such subject matter. This Agreement shall be construed in accordance with the laws of the State of California, without regard to its conflict of laws rules. No waiver by either party of any breach or default hereunder shall be deemed to be a waiver of any preceding or subsequent breach or default. The section headings used herein are for convenience only and shall not be given any legal import.\r\n\r\n</p>         \r\n<p>         \r\n<font color=\"black\">Note:</font>         \r\n          \r\n</p>         \r\n<p>         \r\nWe would like to advise all users to monitor their bidding practices. Placing bids online at www.ibiddjango.com frequently or repeatedly can incur high costs. Users should therefore pay attention to their bidding practices and check their charges regularly.\r\n\r\n</p>\r\n<div class=\"ten_height_spacer\"><!-- --></div>\r\n</div>\r\n<div class=\"white_right_corner\"><!-- --></div>\r\n<div class=\"white_left_corner\"><!-- --></div>\r\n<div class=\"white_bar no_margin_ie6\"><!-- --></div>\r\n</div>\r\n", "enable_comments": false}}, {"pk": 2, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Testimonials", "url": "/testimonials/", "template_name": "", "sites": [1], "content": "<div class=\"faq_div\">\r\n<!-- ****************** 1-st testimonial ********************* -->\r\n<div class=\"gray_header_left\"><!-- --></div>\r\n<div class=\"gray_header_right\"><!-- --></div>\r\n<div class=\"gray_header no_margin_ie6\">Sasha won something...</div>\r\n<div class=\"white_window_bg confirmation_message\">\r\n<div class=\"ten_height_spacer\"></div>\r\n<div class=\"flash_embed testimonials_embed_flash\">\r\n<object width=\"500\" height=\"405\"><param name=\"movie\" value=\"http://www.youtube.com/v/COO6Mw00Sl0&hl=en&fs=1&rel=0&border=1\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://www.youtube.com/v/COO6Mw00Sl0&hl=en&fs=1&rel=0&border=1\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"500\" height=\"405\"></embed></object>\r\n</div>\r\n<div class=\"ten_height_spacer\"><!-- --></div>\r\n<a href=\"http://www.ibiddjango.com/bids/auction/kindle-1/2/\">More info</a>\r\n<div class=\"ten_height_spacer\"><!-- --></div>\r\n</div>\r\n<div class=\"white_left_corner\"><!-- --></div>\r\n<div class=\"white_right_corner\"><!-- --></div>\r\n<div class=\"white_bar no_margin_ie6\"><!-- --></div>\r\n<!-- ****************** end testimonial ********************* -->\r\n</div>", "enable_comments": false}}]
